package com.xuanzhi.tools.gamestat;

import java.io.FileOutputStream;
import java.lang.reflect.Field;
import java.util.ArrayList;

public class TestRowData{

	public static void main(String args[]) throws Exception{
	
		AnalyseTool tool = new AnalyseTool(RowData.class);
		tool.analyse();
		
		for(int i = 0 ; i < tool.errors.size() ; i++){
			System.out.println(""+tool.errors.get(i));
		}
		
		//System.out.println("==========================================================");
		
		TestRowData td = new TestRowData();
		td.init();
		
		
		WebTool wt = new WebTool(RowData.class,td.datas);
		
		FileOutputStream output = new FileOutputStream("d:\\temp\\aaaa.html");
		
		output.write(("<table border='0' cellpadding='0' cellspacing='1' width='100%' bgcolor='#000000' align='center'>").getBytes());
		
		String hiddenHeaders[] = new String[]{"元神加成比","本尊宝石","本尊器灵","元神装备","元神宝石","元神器灵","出战宠物","人物技能","元神坐骑","元神技能"};
		String mergeHeaders[] = new String[]{"本尊装备","本尊坐骑"};
		
		String s1 = wt.constructHTMLHeader(hiddenHeaders,mergeHeaders);
		String s2 = wt.constructHTMLContent(hiddenHeaders,mergeHeaders,0,50,10);
		String s3 = wt.constructHTMLContent(hiddenHeaders,mergeHeaders,50,100,10);
		String s4 = wt.constructHTMLContent(hiddenHeaders,mergeHeaders,100,150,10);
		String s5 = wt.constructHTMLContent(hiddenHeaders,mergeHeaders,150,200,10);
		String s6 = wt.constructHTMLContent(hiddenHeaders,mergeHeaders,200,220,1);
		output.write(s1.getBytes());
		output.write(s2.getBytes());
		output.write(s1.getBytes());
		output.write(s3.getBytes());
		output.write(s1.getBytes());
		output.write(s4.getBytes());
		output.write(s1.getBytes());
		output.write(s5.getBytes());
		output.write(s1.getBytes());
		output.write(s6.getBytes());
		
		output.write( ("</table>").getBytes());
		
		output.close();
		/*
		java.io.ByteArrayOutputStream byteArrays = new java.io.ByteArrayOutputStream();
		java.io.ObjectOutputStream output = new java.io.ObjectOutputStream(byteArrays);
		for(int i = 0 ; i < td.datas.length; i++){
			output.writeObject(td.datas[i]);
			System.out.println("单个对象大小:" + byteArrays.toByteArray().length);
		}
		byteArrays = new java.io.ByteArrayOutputStream();
		 output = new java.io.ObjectOutputStream(byteArrays);
		 output.writeObject(td.datas);
		 System.out.println("数组对象大小:" + byteArrays.toByteArray().length);
		*/
	}
	
	public RowData datas[];
	
	
	public TestRowData(){
		datas = new RowData[220];
		for(int i = 0 ; i < datas.length ; i++){
			datas[i] = new RowData();
		}
	}
	
	
	
	
	public void init(){
		for(int i = 0 ; i < datas.length ; i++){
			RowData d = datas[i];
			
			d.人数 = 1000-i*3;
			
			if(i < 60)
				d.元神开启 = 0;
			else 
				d.元神开启 = (long)(d.人数*(i-60)*1.0f/(220-60));
			
			if(d.元神开启 == 0)
				d.元神等级 = 0;
			else
				d.元神等级 = (long)(d.元神开启*i*0.5);
			
			if(d.元神开启 == 0)
				d.元神加成比 = 0;
			else
				d.元神加成比 = 0.2f*d.元神开启;
			
			d.本尊装备.武器.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.本尊装备.武器.等级 = d.本尊装备.武器.数量 * (50+i/2);
			d.本尊装备.武器.星级 = d.本尊装备.武器.数量 * (1 + i/13);
			d.本尊装备.武器.铭刻 = (long)(d.本尊装备.武器.数量 * randomRange(0.8,1.0));
			
			double rr[] = randomDistribute(7);
			d.本尊装备.武器.颜色.put("白", 		(long)(rr[0]*d.本尊装备.武器.数量));
			d.本尊装备.武器.颜色.put("绿", 		(long)(rr[1]*d.本尊装备.武器.数量));
			d.本尊装备.武器.颜色.put("蓝", 		(long)(rr[2]*d.本尊装备.武器.数量));
			d.本尊装备.武器.颜色.put("紫", 		(long)(rr[3]*d.本尊装备.武器.数量));
			d.本尊装备.武器.颜色.put("完美紫", 	(long)(rr[4]*d.本尊装备.武器.数量));
			d.本尊装备.武器.颜色.put("橙", 		(long)(rr[5]*d.本尊装备.武器.数量));
			d.本尊装备.武器.颜色.put("完美橙", 	(long)(rr[6]*d.本尊装备.武器.数量));
			
			rr = randomDistribute(8);
			d.本尊装备.武器.鉴定.put("普通", 		(long)(rr[0]*d.本尊装备.武器.数量));
			d.本尊装备.武器.鉴定.put("一般", 		(long)(rr[1]*d.本尊装备.武器.数量));
			d.本尊装备.武器.鉴定.put("优秀", 		(long)(rr[2]*d.本尊装备.武器.数量));
			d.本尊装备.武器.鉴定.put("卓越", 		(long)(rr[3]*d.本尊装备.武器.数量));
			d.本尊装备.武器.鉴定.put("完美", 		(long)(rr[4]*d.本尊装备.武器.数量));
			d.本尊装备.武器.鉴定.put("传奇", 		(long)(rr[5]*d.本尊装备.武器.数量));
			d.本尊装备.武器.鉴定.put("传说", 		(long)(rr[6]*d.本尊装备.武器.数量));
			d.本尊装备.武器.鉴定.put("神话", 		(long)(rr[7]*d.本尊装备.武器.数量));
			
			//
			d.本尊装备.头部.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.本尊装备.头部.等级 = d.本尊装备.头部.数量 * (50+i/2);
			d.本尊装备.头部.星级 = d.本尊装备.头部.数量 * (1 + i/13);
			d.本尊装备.头部.铭刻 = (long)(d.本尊装备.头部.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.本尊装备.头部.颜色.put("白", 		(long)(rr[0]*d.本尊装备.头部.数量));
			d.本尊装备.头部.颜色.put("绿", 		(long)(rr[1]*d.本尊装备.头部.数量));
			d.本尊装备.头部.颜色.put("蓝", 		(long)(rr[2]*d.本尊装备.头部.数量));
			d.本尊装备.头部.颜色.put("紫", 		(long)(rr[3]*d.本尊装备.头部.数量));
			d.本尊装备.头部.颜色.put("完美紫", 	(long)(rr[4]*d.本尊装备.头部.数量));
			d.本尊装备.头部.颜色.put("橙", 		(long)(rr[5]*d.本尊装备.头部.数量));
			d.本尊装备.头部.颜色.put("完美橙", 	(long)(rr[6]*d.本尊装备.头部.数量));
			
			rr = randomDistribute(8);
			d.本尊装备.头部.鉴定.put("普通", 		(long)(rr[0]*d.本尊装备.头部.数量));
			d.本尊装备.头部.鉴定.put("一般", 		(long)(rr[1]*d.本尊装备.头部.数量));
			d.本尊装备.头部.鉴定.put("优秀", 		(long)(rr[2]*d.本尊装备.头部.数量));
			d.本尊装备.头部.鉴定.put("卓越", 		(long)(rr[3]*d.本尊装备.头部.数量));
			d.本尊装备.头部.鉴定.put("完美", 		(long)(rr[4]*d.本尊装备.头部.数量));
			d.本尊装备.头部.鉴定.put("传奇", 		(long)(rr[5]*d.本尊装备.头部.数量));
			d.本尊装备.头部.鉴定.put("传说", 		(long)(rr[6]*d.本尊装备.头部.数量));
			d.本尊装备.头部.鉴定.put("神话", 		(long)(rr[7]*d.本尊装备.头部.数量));
			
			//
			d.本尊装备.饰品.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.本尊装备.饰品.等级 = d.本尊装备.饰品.数量 * (50+i/2);
			d.本尊装备.饰品.星级 = d.本尊装备.饰品.数量 * (1 + i/13);
			d.本尊装备.饰品.铭刻 = (long)(d.本尊装备.饰品.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.本尊装备.饰品.颜色.put("白", 		(long)(rr[0]*d.本尊装备.饰品.数量));
			d.本尊装备.饰品.颜色.put("绿", 		(long)(rr[1]*d.本尊装备.饰品.数量));
			d.本尊装备.饰品.颜色.put("蓝", 		(long)(rr[2]*d.本尊装备.饰品.数量));
			d.本尊装备.饰品.颜色.put("紫", 		(long)(rr[3]*d.本尊装备.饰品.数量));
			d.本尊装备.饰品.颜色.put("完美紫", 	(long)(rr[4]*d.本尊装备.饰品.数量));
			d.本尊装备.饰品.颜色.put("橙", 		(long)(rr[5]*d.本尊装备.饰品.数量));
			d.本尊装备.饰品.颜色.put("完美橙", 	(long)(rr[6]*d.本尊装备.饰品.数量));
			
			rr = randomDistribute(8);
			d.本尊装备.饰品.鉴定.put("普通", 		(long)(rr[0]*d.本尊装备.饰品.数量));
			d.本尊装备.饰品.鉴定.put("一般", 		(long)(rr[1]*d.本尊装备.饰品.数量));
			d.本尊装备.饰品.鉴定.put("优秀", 		(long)(rr[2]*d.本尊装备.饰品.数量));
			d.本尊装备.饰品.鉴定.put("卓越", 		(long)(rr[3]*d.本尊装备.饰品.数量));
			d.本尊装备.饰品.鉴定.put("完美", 		(long)(rr[4]*d.本尊装备.饰品.数量));
			d.本尊装备.饰品.鉴定.put("传奇", 		(long)(rr[5]*d.本尊装备.饰品.数量));
			d.本尊装备.饰品.鉴定.put("传说", 		(long)(rr[6]*d.本尊装备.饰品.数量));
			d.本尊装备.饰品.鉴定.put("神话", 		(long)(rr[7]*d.本尊装备.饰品.数量));
			
			//
			d.本尊装备.腰带.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.本尊装备.腰带.等级 = d.本尊装备.腰带.数量 * (50+i/2);
			d.本尊装备.腰带.星级 = d.本尊装备.腰带.数量 * (1 + i/13);
			d.本尊装备.腰带.铭刻 = (long)(d.本尊装备.腰带.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.本尊装备.腰带.颜色.put("白", 		(long)(rr[0]*d.本尊装备.腰带.数量));
			d.本尊装备.腰带.颜色.put("绿", 		(long)(rr[1]*d.本尊装备.腰带.数量));
			d.本尊装备.腰带.颜色.put("蓝", 		(long)(rr[2]*d.本尊装备.腰带.数量));
			d.本尊装备.腰带.颜色.put("紫", 		(long)(rr[3]*d.本尊装备.腰带.数量));
			d.本尊装备.腰带.颜色.put("完美紫", 	(long)(rr[4]*d.本尊装备.腰带.数量));
			d.本尊装备.腰带.颜色.put("橙", 		(long)(rr[5]*d.本尊装备.腰带.数量));
			d.本尊装备.腰带.颜色.put("完美橙", 	(long)(rr[6]*d.本尊装备.腰带.数量));
			
			rr = randomDistribute(8);
			d.本尊装备.腰带.鉴定.put("普通", 		(long)(rr[0]*d.本尊装备.腰带.数量));
			d.本尊装备.腰带.鉴定.put("一般", 		(long)(rr[1]*d.本尊装备.腰带.数量));
			d.本尊装备.腰带.鉴定.put("优秀", 		(long)(rr[2]*d.本尊装备.腰带.数量));
			d.本尊装备.腰带.鉴定.put("卓越", 		(long)(rr[3]*d.本尊装备.腰带.数量));
			d.本尊装备.腰带.鉴定.put("完美", 		(long)(rr[4]*d.本尊装备.腰带.数量));
			d.本尊装备.腰带.鉴定.put("传奇", 		(long)(rr[5]*d.本尊装备.腰带.数量));
			d.本尊装备.腰带.鉴定.put("传说", 		(long)(rr[6]*d.本尊装备.腰带.数量));
			d.本尊装备.腰带.鉴定.put("神话", 		(long)(rr[7]*d.本尊装备.腰带.数量));
			
			//
			d.本尊装备.项链.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.本尊装备.项链.等级 = d.本尊装备.项链.数量 * (50+i/2);
			d.本尊装备.项链.星级 = d.本尊装备.项链.数量 * (1 + i/13);
			d.本尊装备.项链.铭刻 = (long)(d.本尊装备.项链.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.本尊装备.项链.颜色.put("白", 		(long)(rr[0]*d.本尊装备.项链.数量));
			d.本尊装备.项链.颜色.put("绿", 		(long)(rr[1]*d.本尊装备.项链.数量));
			d.本尊装备.项链.颜色.put("蓝", 		(long)(rr[2]*d.本尊装备.项链.数量));
			d.本尊装备.项链.颜色.put("紫", 		(long)(rr[3]*d.本尊装备.项链.数量));
			d.本尊装备.项链.颜色.put("完美紫", 	(long)(rr[4]*d.本尊装备.项链.数量));
			d.本尊装备.项链.颜色.put("橙", 		(long)(rr[5]*d.本尊装备.项链.数量));
			d.本尊装备.项链.颜色.put("完美橙", 	(long)(rr[6]*d.本尊装备.项链.数量));
			
			rr = randomDistribute(8);
			d.本尊装备.项链.鉴定.put("普通", 		(long)(rr[0]*d.本尊装备.项链.数量));
			d.本尊装备.项链.鉴定.put("一般", 		(long)(rr[1]*d.本尊装备.项链.数量));
			d.本尊装备.项链.鉴定.put("优秀", 		(long)(rr[2]*d.本尊装备.项链.数量));
			d.本尊装备.项链.鉴定.put("卓越", 		(long)(rr[3]*d.本尊装备.项链.数量));
			d.本尊装备.项链.鉴定.put("完美", 		(long)(rr[4]*d.本尊装备.项链.数量));
			d.本尊装备.项链.鉴定.put("传奇", 		(long)(rr[5]*d.本尊装备.项链.数量));
			d.本尊装备.项链.鉴定.put("传说", 		(long)(rr[6]*d.本尊装备.项链.数量));
			d.本尊装备.项链.鉴定.put("神话", 		(long)(rr[7]*d.本尊装备.项链.数量));
			
			//
			d.本尊装备.鞋子.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.本尊装备.鞋子.等级 = d.本尊装备.鞋子.数量 * (50+i/2);
			d.本尊装备.鞋子.星级 = d.本尊装备.鞋子.数量 * (1 + i/13);
			d.本尊装备.鞋子.铭刻 = (long)(d.本尊装备.鞋子.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.本尊装备.鞋子.颜色.put("白", 		(long)(rr[0]*d.本尊装备.鞋子.数量));
			d.本尊装备.鞋子.颜色.put("绿", 		(long)(rr[1]*d.本尊装备.鞋子.数量));
			d.本尊装备.鞋子.颜色.put("蓝", 		(long)(rr[2]*d.本尊装备.鞋子.数量));
			d.本尊装备.鞋子.颜色.put("紫", 		(long)(rr[3]*d.本尊装备.鞋子.数量));
			d.本尊装备.鞋子.颜色.put("完美紫", 	(long)(rr[4]*d.本尊装备.鞋子.数量));
			d.本尊装备.鞋子.颜色.put("橙", 		(long)(rr[5]*d.本尊装备.鞋子.数量));
			d.本尊装备.鞋子.颜色.put("完美橙", 	(long)(rr[6]*d.本尊装备.鞋子.数量));
			
			rr = randomDistribute(8);
			d.本尊装备.鞋子.鉴定.put("普通", 		(long)(rr[0]*d.本尊装备.鞋子.数量));
			d.本尊装备.鞋子.鉴定.put("一般", 		(long)(rr[1]*d.本尊装备.鞋子.数量));
			d.本尊装备.鞋子.鉴定.put("优秀", 		(long)(rr[2]*d.本尊装备.鞋子.数量));
			d.本尊装备.鞋子.鉴定.put("卓越", 		(long)(rr[3]*d.本尊装备.鞋子.数量));
			d.本尊装备.鞋子.鉴定.put("完美", 		(long)(rr[4]*d.本尊装备.鞋子.数量));
			d.本尊装备.鞋子.鉴定.put("传奇", 		(long)(rr[5]*d.本尊装备.鞋子.数量));
			d.本尊装备.鞋子.鉴定.put("传说", 		(long)(rr[6]*d.本尊装备.鞋子.数量));
			d.本尊装备.鞋子.鉴定.put("神话", 		(long)(rr[7]*d.本尊装备.鞋子.数量));
			
			//
			d.本尊装备.戒指.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.本尊装备.戒指.等级 = d.本尊装备.戒指.数量 * (50+i/2);
			d.本尊装备.戒指.星级 = d.本尊装备.戒指.数量 * (1 + i/13);
			d.本尊装备.戒指.铭刻 = (long)(d.本尊装备.戒指.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.本尊装备.戒指.颜色.put("白", 		(long)(rr[0]*d.本尊装备.戒指.数量));
			d.本尊装备.戒指.颜色.put("绿", 		(long)(rr[1]*d.本尊装备.戒指.数量));
			d.本尊装备.戒指.颜色.put("蓝", 		(long)(rr[2]*d.本尊装备.戒指.数量));
			d.本尊装备.戒指.颜色.put("紫", 		(long)(rr[3]*d.本尊装备.戒指.数量));
			d.本尊装备.戒指.颜色.put("完美紫", 	(long)(rr[4]*d.本尊装备.戒指.数量));
			d.本尊装备.戒指.颜色.put("橙", 		(long)(rr[5]*d.本尊装备.戒指.数量));
			d.本尊装备.戒指.颜色.put("完美橙", 	(long)(rr[6]*d.本尊装备.戒指.数量));
			
			rr = randomDistribute(8);
			d.本尊装备.戒指.鉴定.put("普通", 		(long)(rr[0]*d.本尊装备.戒指.数量));
			d.本尊装备.戒指.鉴定.put("一般", 		(long)(rr[1]*d.本尊装备.戒指.数量));
			d.本尊装备.戒指.鉴定.put("优秀", 		(long)(rr[2]*d.本尊装备.戒指.数量));
			d.本尊装备.戒指.鉴定.put("卓越", 		(long)(rr[3]*d.本尊装备.戒指.数量));
			d.本尊装备.戒指.鉴定.put("完美", 		(long)(rr[4]*d.本尊装备.戒指.数量));
			d.本尊装备.戒指.鉴定.put("传奇", 		(long)(rr[5]*d.本尊装备.戒指.数量));
			d.本尊装备.戒指.鉴定.put("传说", 		(long)(rr[6]*d.本尊装备.戒指.数量));
			d.本尊装备.戒指.鉴定.put("神话", 		(long)(rr[7]*d.本尊装备.戒指.数量));
			
			//
			d.本尊装备.护腕.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.本尊装备.护腕.等级 = d.本尊装备.护腕.数量 * (50+i/2);
			d.本尊装备.护腕.星级 = d.本尊装备.护腕.数量 * (1 + i/13);
			d.本尊装备.护腕.铭刻 = (long)(d.本尊装备.护腕.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.本尊装备.护腕.颜色.put("白", 		(long)(rr[0]*d.本尊装备.护腕.数量));
			d.本尊装备.护腕.颜色.put("绿", 		(long)(rr[1]*d.本尊装备.护腕.数量));
			d.本尊装备.护腕.颜色.put("蓝", 		(long)(rr[2]*d.本尊装备.护腕.数量));
			d.本尊装备.护腕.颜色.put("紫", 		(long)(rr[3]*d.本尊装备.护腕.数量));
			d.本尊装备.护腕.颜色.put("完美紫", 	(long)(rr[4]*d.本尊装备.护腕.数量));
			d.本尊装备.护腕.颜色.put("橙", 		(long)(rr[5]*d.本尊装备.护腕.数量));
			d.本尊装备.护腕.颜色.put("完美橙", 	(long)(rr[6]*d.本尊装备.护腕.数量));
			
			rr = randomDistribute(8);
			d.本尊装备.护腕.鉴定.put("普通", 		(long)(rr[0]*d.本尊装备.护腕.数量));
			d.本尊装备.护腕.鉴定.put("一般", 		(long)(rr[1]*d.本尊装备.护腕.数量));
			d.本尊装备.护腕.鉴定.put("优秀", 		(long)(rr[2]*d.本尊装备.护腕.数量));
			d.本尊装备.护腕.鉴定.put("卓越", 		(long)(rr[3]*d.本尊装备.护腕.数量));
			d.本尊装备.护腕.鉴定.put("完美", 		(long)(rr[4]*d.本尊装备.护腕.数量));
			d.本尊装备.护腕.鉴定.put("传奇", 		(long)(rr[5]*d.本尊装备.护腕.数量));
			d.本尊装备.护腕.鉴定.put("传说", 		(long)(rr[6]*d.本尊装备.护腕.数量));
			d.本尊装备.护腕.鉴定.put("神话", 		(long)(rr[7]*d.本尊装备.护腕.数量));
			
			//
			d.本尊装备.肩部.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.本尊装备.肩部.等级 = d.本尊装备.肩部.数量 * (50+i/2);
			d.本尊装备.肩部.星级 = d.本尊装备.肩部.数量 * (1 + i/13);
			d.本尊装备.肩部.铭刻 = (long)(d.本尊装备.肩部.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.本尊装备.肩部.颜色.put("白", 		(long)(rr[0]*d.本尊装备.肩部.数量));
			d.本尊装备.肩部.颜色.put("绿", 		(long)(rr[1]*d.本尊装备.肩部.数量));
			d.本尊装备.肩部.颜色.put("蓝", 		(long)(rr[2]*d.本尊装备.肩部.数量));
			d.本尊装备.肩部.颜色.put("紫", 		(long)(rr[3]*d.本尊装备.肩部.数量));
			d.本尊装备.肩部.颜色.put("完美紫", 	(long)(rr[4]*d.本尊装备.肩部.数量));
			d.本尊装备.肩部.颜色.put("橙", 		(long)(rr[5]*d.本尊装备.肩部.数量));
			d.本尊装备.肩部.颜色.put("完美橙", 	(long)(rr[6]*d.本尊装备.肩部.数量));
			
			rr = randomDistribute(8);
			d.本尊装备.肩部.鉴定.put("普通", 		(long)(rr[0]*d.本尊装备.肩部.数量));
			d.本尊装备.肩部.鉴定.put("一般", 		(long)(rr[1]*d.本尊装备.肩部.数量));
			d.本尊装备.肩部.鉴定.put("优秀", 		(long)(rr[2]*d.本尊装备.肩部.数量));
			d.本尊装备.肩部.鉴定.put("卓越", 		(long)(rr[3]*d.本尊装备.肩部.数量));
			d.本尊装备.肩部.鉴定.put("完美", 		(long)(rr[4]*d.本尊装备.肩部.数量));
			d.本尊装备.肩部.鉴定.put("传奇", 		(long)(rr[5]*d.本尊装备.肩部.数量));
			d.本尊装备.肩部.鉴定.put("传说", 		(long)(rr[6]*d.本尊装备.肩部.数量));
			d.本尊装备.肩部.鉴定.put("神话", 		(long)(rr[7]*d.本尊装备.肩部.数量));
			
			//
			d.本尊装备.胸部.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.本尊装备.胸部.等级 = d.本尊装备.胸部.数量 * (50+i/2);
			d.本尊装备.胸部.星级 = d.本尊装备.胸部.数量 * (1 + i/13);
			d.本尊装备.胸部.铭刻 = (long)(d.本尊装备.胸部.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.本尊装备.胸部.颜色.put("白", 		(long)(rr[0]*d.本尊装备.胸部.数量));
			d.本尊装备.胸部.颜色.put("绿", 		(long)(rr[1]*d.本尊装备.胸部.数量));
			d.本尊装备.胸部.颜色.put("蓝", 		(long)(rr[2]*d.本尊装备.胸部.数量));
			d.本尊装备.胸部.颜色.put("紫", 		(long)(rr[3]*d.本尊装备.胸部.数量));
			d.本尊装备.胸部.颜色.put("完美紫", 	(long)(rr[4]*d.本尊装备.胸部.数量));
			d.本尊装备.胸部.颜色.put("橙", 		(long)(rr[5]*d.本尊装备.胸部.数量));
			d.本尊装备.胸部.颜色.put("完美橙", 	(long)(rr[6]*d.本尊装备.胸部.数量));
			
			rr = randomDistribute(8);
			d.本尊装备.胸部.鉴定.put("普通", 		(long)(rr[0]*d.本尊装备.胸部.数量));
			d.本尊装备.胸部.鉴定.put("一般", 		(long)(rr[1]*d.本尊装备.胸部.数量));
			d.本尊装备.胸部.鉴定.put("优秀", 		(long)(rr[2]*d.本尊装备.胸部.数量));
			d.本尊装备.胸部.鉴定.put("卓越", 		(long)(rr[3]*d.本尊装备.胸部.数量));
			d.本尊装备.胸部.鉴定.put("完美", 		(long)(rr[4]*d.本尊装备.胸部.数量));
			d.本尊装备.胸部.鉴定.put("传奇", 		(long)(rr[5]*d.本尊装备.胸部.数量));
			d.本尊装备.胸部.鉴定.put("传说", 		(long)(rr[6]*d.本尊装备.胸部.数量));
			d.本尊装备.胸部.鉴定.put("神话", 		(long)(rr[7]*d.本尊装备.胸部.数量));
			
			
			//
			d.本尊宝石.宝石竹清.孔数 = (long)(d.人数 * randomRange(2,3));
			d.本尊宝石.宝石竹清.镶嵌 = (long)(d.本尊宝石.宝石竹清.孔数 * randomRange(0.5,1.0));
			d.本尊宝石.宝石竹清.等级 = (long)(d.本尊宝石.宝石竹清.镶嵌 * randomRange(1,9));
			
			//
			d.本尊宝石.宝石枳香.孔数 = (long)(d.人数 * randomRange(2,3));
			d.本尊宝石.宝石枳香.镶嵌 = (long)(d.本尊宝石.宝石枳香.孔数 * randomRange(0.5,1.0));
			d.本尊宝石.宝石枳香.等级 = (long)(d.本尊宝石.宝石枳香.镶嵌 * randomRange(1,9));
			
			//
			d.本尊宝石.宝石幽橘.孔数 = (long)(d.人数 * randomRange(2,3));
			d.本尊宝石.宝石幽橘.镶嵌 = (long)(d.本尊宝石.宝石幽橘.孔数 * randomRange(0.5,1.0));
			d.本尊宝石.宝石幽橘.等级 = (long)(d.本尊宝石.宝石幽橘.镶嵌 * randomRange(1,9));
			
			//
			d.本尊宝石.宝石湛天.孔数 = (long)(d.人数 * randomRange(2,3));
			d.本尊宝石.宝石湛天.镶嵌 = (long)(d.本尊宝石.宝石湛天.孔数 * randomRange(0.5,1.0));
			d.本尊宝石.宝石湛天.等级 = (long)(d.本尊宝石.宝石湛天.镶嵌 * randomRange(1,9));
			
			//
			d.本尊宝石.宝石墨轮.孔数 = (long)(d.人数 * randomRange(2,3));
			d.本尊宝石.宝石墨轮.镶嵌 = (long)(d.本尊宝石.宝石墨轮.孔数 * randomRange(0.5,1.0));
			d.本尊宝石.宝石墨轮.等级 = (long)(d.本尊宝石.宝石墨轮.镶嵌 * randomRange(1,9));
			
			//
			d.本尊宝石.宝石炎焚.孔数 = (long)(d.人数 * randomRange(2,3));
			d.本尊宝石.宝石炎焚.镶嵌 = (long)(d.本尊宝石.宝石炎焚.孔数 * randomRange(0.5,1.0));
			d.本尊宝石.宝石炎焚.等级 = (long)(d.本尊宝石.宝石炎焚.镶嵌 * randomRange(1,9));
			
			//
			d.本尊宝石.宝石无相.孔数 = (long)(d.人数 * randomRange(2,3));
			d.本尊宝石.宝石无相.镶嵌 = (long)(d.本尊宝石.宝石无相.孔数 * randomRange(0.5,1.0));
			d.本尊宝石.宝石无相.等级 = (long)(d.本尊宝石.宝石无相.镶嵌 * randomRange(1,9));
			
			//
			d.本尊宝石.宝石魔渊.孔数 = (long)(d.人数 * randomRange(2,3));
			d.本尊宝石.宝石魔渊.镶嵌 = (long)(d.本尊宝石.宝石魔渊.孔数 * randomRange(0.5,1.0));
			d.本尊宝石.宝石魔渊.等级 = (long)(d.本尊宝石.宝石魔渊.镶嵌 * randomRange(1,9));
			
			//
			d.本尊宝石.宝石混沌.孔数 = (long)(d.人数 * randomRange(2,3));
			d.本尊宝石.宝石混沌.镶嵌 = (long)(d.本尊宝石.宝石混沌.孔数 * randomRange(0.5,1.0));
			d.本尊宝石.宝石混沌.等级 = (long)(d.本尊宝石.宝石混沌.镶嵌 * randomRange(1,9));
			
			////////
			
			d.出战宠物.基本情况.数量 = (long)(d.人数 * randomRange(0.8,1));
			d.出战宠物.基本情况.等级 = (long)(d.出战宠物.基本情况.数量 * d.角色等级 * randomRange(0.8,1));
			d.出战宠物.基本情况.携带等级 = (long)(d.出战宠物.基本情况.数量 * d.角色等级 * randomRange(0.5,1));
			
			rr = randomDistribute(4);
			d.出战宠物.基本情况.稀有度.put("随处可见", (long)(rr[0] * d.出战宠物.基本情况.数量));
			d.出战宠物.基本情况.稀有度.put("百里挑一", (long)(rr[1] * d.出战宠物.基本情况.数量));
			d.出战宠物.基本情况.稀有度.put("千载难逢", (long)(rr[2] * d.出战宠物.基本情况.数量));
			d.出战宠物.基本情况.稀有度.put("万年不遇", (long)(rr[3] * d.出战宠物.基本情况.数量));
			
			rr = randomDistribute(4);
			d.出战宠物.基本情况.性格倾向.put("忠诚", (long)(rr[0] * d.出战宠物.基本情况.数量));
			d.出战宠物.基本情况.性格倾向.put("谨慎", (long)(rr[1] * d.出战宠物.基本情况.数量));
			d.出战宠物.基本情况.性格倾向.put("精明", (long)(rr[2] * d.出战宠物.基本情况.数量));
			d.出战宠物.基本情况.性格倾向.put("狡猾", (long)(rr[3] * d.出战宠物.基本情况.数量));
			
			rr = randomDistribute(7);
			d.出战宠物.基本情况.繁殖开蛋.put("一代", (long)(rr[0] * d.出战宠物.基本情况.数量));
			d.出战宠物.基本情况.繁殖开蛋.put("二代", (long)(rr[1] * d.出战宠物.基本情况.数量));
			d.出战宠物.基本情况.繁殖开蛋.put("一级变异", (long)(rr[2] * d.出战宠物.基本情况.数量));
			d.出战宠物.基本情况.繁殖开蛋.put("二级变异", (long)(rr[3] * d.出战宠物.基本情况.数量));
			d.出战宠物.基本情况.繁殖开蛋.put("三级变异", (long)(rr[4] * d.出战宠物.基本情况.数量));
			d.出战宠物.基本情况.繁殖开蛋.put("四级变异", (long)(rr[5] * d.出战宠物.基本情况.数量));
			d.出战宠物.基本情况.繁殖开蛋.put("五级变异", (long)(rr[6] * d.出战宠物.基本情况.数量));
			
			d.出战宠物.宠物强化.炼妖 = (long)(d.人数 *randomRange(0.8,1.0));
			d.出战宠物.宠物强化.强化 = (long)(d.人数 *randomRange(1,20));
			
			d.出战宠物.宠物技能.主动技能格 = (long)(d.人数 *randomRange(3,10));
			d.出战宠物.宠物技能.被动技能格 = (long)(d.人数 *randomRange(1,4));
			
			rr = randomDistribute(10);
			d.出战宠物.宠物技能.主动技能.put("空",(long)(rr[0] * d.出战宠物.宠物技能.主动技能格));
			d.出战宠物.宠物技能.主动技能.put("1级初级",(long)(rr[1] * d.出战宠物.宠物技能.主动技能格));
			d.出战宠物.宠物技能.主动技能.put("1级中级",(long)(rr[2] * d.出战宠物.宠物技能.主动技能格));
			d.出战宠物.宠物技能.主动技能.put("1级高级",(long)(rr[3] * d.出战宠物.宠物技能.主动技能格));
			d.出战宠物.宠物技能.主动技能.put("2级初级",(long)(rr[4] * d.出战宠物.宠物技能.主动技能格));
			d.出战宠物.宠物技能.主动技能.put("2级中级",(long)(rr[5] * d.出战宠物.宠物技能.主动技能格));
			d.出战宠物.宠物技能.主动技能.put("2级高级",(long)(rr[6] * d.出战宠物.宠物技能.主动技能格));
			d.出战宠物.宠物技能.主动技能.put("3级初级",(long)(rr[7] * d.出战宠物.宠物技能.主动技能格));
			d.出战宠物.宠物技能.主动技能.put("3级中级",(long)(rr[8] * d.出战宠物.宠物技能.主动技能格));
			d.出战宠物.宠物技能.主动技能.put("3级高级",(long)(rr[9] * d.出战宠物.宠物技能.主动技能格));
			
			rr = randomDistribute(4);
			d.出战宠物.宠物技能.被动技能.put("空",(long)(rr[0] * d.出战宠物.宠物技能.被动技能格));
			d.出战宠物.宠物技能.被动技能.put("1级",(long)(rr[1] * d.出战宠物.宠物技能.被动技能格));
			d.出战宠物.宠物技能.被动技能.put("2级",(long)(rr[2] * d.出战宠物.宠物技能.被动技能格));
			d.出战宠物.宠物技能.被动技能.put("3级",(long)(rr[3] * d.出战宠物.宠物技能.被动技能格));
			
			//////
			d.人物技能.本尊进阶技能._41级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.人物技能.本尊进阶技能._56级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.人物技能.本尊进阶技能._71级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.人物技能.本尊进阶技能._86级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.人物技能.本尊进阶技能._101级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.人物技能.本尊进阶技能._116级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.人物技能.本尊进阶技能._131级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.人物技能.本尊进阶技能._146级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.人物技能.本尊进阶技能._161级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.人物技能.本尊进阶技能._176级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.人物技能.本尊进阶技能._191级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.人物技能.本尊进阶技能._206级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			
			d.人物技能.心法.血心法等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.心法.外防心法等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.心法.外攻心法等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.心法.内防心法等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.心法.内法心法等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			
			d.人物技能.注魂.火攻等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.注魂.火防等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.注魂.火减抗等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.注魂.冰攻等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.注魂.冰防等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.注魂.冰减抗等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.注魂.雷攻等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.注魂.雷防等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.注魂.雷减抗等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.注魂.风攻等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.注魂.风防等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			d.人物技能.注魂.风减抗等级 = (long)(d.人数 * 100 * randomRange(0.6,1));
			
			////
			//
			d.本尊器灵.长生之灵_生命.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.本尊器灵.长生之灵_生命.镶嵌 = (long)(d.本尊器灵.长生之灵_生命.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.本尊器灵.长生之灵_生命.品质.put("白器灵", (long)(d.本尊器灵.长生之灵_生命.镶嵌 * rr[0]));
			d.本尊器灵.长生之灵_生命.品质.put("绿器灵", (long)(d.本尊器灵.长生之灵_生命.镶嵌 * rr[1]));
			d.本尊器灵.长生之灵_生命.品质.put("蓝器灵", (long)(d.本尊器灵.长生之灵_生命.镶嵌 * rr[2]));
			d.本尊器灵.长生之灵_生命.品质.put("紫器灵", (long)(d.本尊器灵.长生之灵_生命.镶嵌 * rr[3]));
			d.本尊器灵.长生之灵_生命.品质.put("橙器灵", (long)(d.本尊器灵.长生之灵_生命.镶嵌 * rr[4]));
			
			d.本尊器灵.长生之灵_生命.白器灵填充 = (float)randomRange(0,1) * d.本尊器灵.长生之灵_生命.品质.get("白器灵");
			d.本尊器灵.长生之灵_生命.绿器灵填充 = (float)randomRange(0,1) * d.本尊器灵.长生之灵_生命.品质.get("绿器灵");
			d.本尊器灵.长生之灵_生命.蓝器灵填充 = (float)randomRange(0,1) * d.本尊器灵.长生之灵_生命.品质.get("蓝器灵");
			d.本尊器灵.长生之灵_生命.紫器灵填充 = (float)randomRange(0,1) * d.本尊器灵.长生之灵_生命.品质.get("紫器灵");
			d.本尊器灵.长生之灵_生命.橙器灵填充 = (float)randomRange(0,1) * d.本尊器灵.长生之灵_生命.品质.get("橙器灵");
			
			//
			d.本尊器灵.擎天之灵_外攻.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.本尊器灵.擎天之灵_外攻.镶嵌 = (long)(d.本尊器灵.擎天之灵_外攻.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.本尊器灵.擎天之灵_外攻.品质.put("白器灵", (long)(d.本尊器灵.擎天之灵_外攻.镶嵌 * rr[0]));
			d.本尊器灵.擎天之灵_外攻.品质.put("绿器灵", (long)(d.本尊器灵.擎天之灵_外攻.镶嵌 * rr[1]));
			d.本尊器灵.擎天之灵_外攻.品质.put("蓝器灵", (long)(d.本尊器灵.擎天之灵_外攻.镶嵌 * rr[2]));
			d.本尊器灵.擎天之灵_外攻.品质.put("紫器灵", (long)(d.本尊器灵.擎天之灵_外攻.镶嵌 * rr[3]));
			d.本尊器灵.擎天之灵_外攻.品质.put("橙器灵", (long)(d.本尊器灵.擎天之灵_外攻.镶嵌 * rr[4]));
			
			d.本尊器灵.擎天之灵_外攻.白器灵填充 = (float)randomRange(0,1) * d.本尊器灵.擎天之灵_外攻.品质.get("白器灵");
			d.本尊器灵.擎天之灵_外攻.绿器灵填充 = (float)randomRange(0,1) * d.本尊器灵.擎天之灵_外攻.品质.get("绿器灵");
			d.本尊器灵.擎天之灵_外攻.蓝器灵填充 = (float)randomRange(0,1) * d.本尊器灵.擎天之灵_外攻.品质.get("蓝器灵");
			d.本尊器灵.擎天之灵_外攻.紫器灵填充 = (float)randomRange(0,1) * d.本尊器灵.擎天之灵_外攻.品质.get("紫器灵");
			d.本尊器灵.擎天之灵_外攻.橙器灵填充 = (float)randomRange(0,1) * d.本尊器灵.擎天之灵_外攻.品质.get("橙器灵");
			
			
			//
			d.本尊器灵.琼浆之灵_内法.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.本尊器灵.琼浆之灵_内法.镶嵌 = (long)(d.本尊器灵.琼浆之灵_内法.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.本尊器灵.琼浆之灵_内法.品质.put("白器灵", (long)(d.本尊器灵.琼浆之灵_内法.镶嵌 * rr[0]));
			d.本尊器灵.琼浆之灵_内法.品质.put("绿器灵", (long)(d.本尊器灵.琼浆之灵_内法.镶嵌 * rr[1]));
			d.本尊器灵.琼浆之灵_内法.品质.put("蓝器灵", (long)(d.本尊器灵.琼浆之灵_内法.镶嵌 * rr[2]));
			d.本尊器灵.琼浆之灵_内法.品质.put("紫器灵", (long)(d.本尊器灵.琼浆之灵_内法.镶嵌 * rr[3]));
			d.本尊器灵.琼浆之灵_内法.品质.put("橙器灵", (long)(d.本尊器灵.琼浆之灵_内法.镶嵌 * rr[4]));
			
			d.本尊器灵.琼浆之灵_内法.白器灵填充 = (float)randomRange(0,1) * d.本尊器灵.琼浆之灵_内法.品质.get("白器灵");
			d.本尊器灵.琼浆之灵_内法.绿器灵填充 = (float)randomRange(0,1) * d.本尊器灵.琼浆之灵_内法.品质.get("绿器灵");
			d.本尊器灵.琼浆之灵_内法.蓝器灵填充 = (float)randomRange(0,1) * d.本尊器灵.琼浆之灵_内法.品质.get("蓝器灵");
			d.本尊器灵.琼浆之灵_内法.紫器灵填充 = (float)randomRange(0,1) * d.本尊器灵.琼浆之灵_内法.品质.get("紫器灵");
			d.本尊器灵.琼浆之灵_内法.橙器灵填充 = (float)randomRange(0,1) * d.本尊器灵.琼浆之灵_内法.品质.get("橙器灵");
			
			
			//
			d.本尊器灵.金汤之灵_外防.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.本尊器灵.金汤之灵_外防.镶嵌 = (long)(d.本尊器灵.金汤之灵_外防.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.本尊器灵.金汤之灵_外防.品质.put("白器灵", (long)(d.本尊器灵.金汤之灵_外防.镶嵌 * rr[0]));
			d.本尊器灵.金汤之灵_外防.品质.put("绿器灵", (long)(d.本尊器灵.金汤之灵_外防.镶嵌 * rr[1]));
			d.本尊器灵.金汤之灵_外防.品质.put("蓝器灵", (long)(d.本尊器灵.金汤之灵_外防.镶嵌 * rr[2]));
			d.本尊器灵.金汤之灵_外防.品质.put("紫器灵", (long)(d.本尊器灵.金汤之灵_外防.镶嵌 * rr[3]));
			d.本尊器灵.金汤之灵_外防.品质.put("橙器灵", (long)(d.本尊器灵.金汤之灵_外防.镶嵌 * rr[4]));
			
			d.本尊器灵.金汤之灵_外防.白器灵填充 = (float)randomRange(0,1) * d.本尊器灵.金汤之灵_外防.品质.get("白器灵");
			d.本尊器灵.金汤之灵_外防.绿器灵填充 = (float)randomRange(0,1) * d.本尊器灵.金汤之灵_外防.品质.get("绿器灵");
			d.本尊器灵.金汤之灵_外防.蓝器灵填充 = (float)randomRange(0,1) * d.本尊器灵.金汤之灵_外防.品质.get("蓝器灵");
			d.本尊器灵.金汤之灵_外防.紫器灵填充 = (float)randomRange(0,1) * d.本尊器灵.金汤之灵_外防.品质.get("紫器灵");
			d.本尊器灵.金汤之灵_外防.橙器灵填充 = (float)randomRange(0,1) * d.本尊器灵.金汤之灵_外防.品质.get("橙器灵");
			
			
			//
			d.本尊器灵.罡岚之灵_内防.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.本尊器灵.罡岚之灵_内防.镶嵌 = (long)(d.本尊器灵.罡岚之灵_内防.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.本尊器灵.罡岚之灵_内防.品质.put("白器灵", (long)(d.本尊器灵.罡岚之灵_内防.镶嵌 * rr[0]));
			d.本尊器灵.罡岚之灵_内防.品质.put("绿器灵", (long)(d.本尊器灵.罡岚之灵_内防.镶嵌 * rr[1]));
			d.本尊器灵.罡岚之灵_内防.品质.put("蓝器灵", (long)(d.本尊器灵.罡岚之灵_内防.镶嵌 * rr[2]));
			d.本尊器灵.罡岚之灵_内防.品质.put("紫器灵", (long)(d.本尊器灵.罡岚之灵_内防.镶嵌 * rr[3]));
			d.本尊器灵.罡岚之灵_内防.品质.put("橙器灵", (long)(d.本尊器灵.罡岚之灵_内防.镶嵌 * rr[4]));
			
			d.本尊器灵.罡岚之灵_内防.白器灵填充 = (float)randomRange(0,1) * d.本尊器灵.罡岚之灵_内防.品质.get("白器灵");
			d.本尊器灵.罡岚之灵_内防.绿器灵填充 = (float)randomRange(0,1) * d.本尊器灵.罡岚之灵_内防.品质.get("绿器灵");
			d.本尊器灵.罡岚之灵_内防.蓝器灵填充 = (float)randomRange(0,1) * d.本尊器灵.罡岚之灵_内防.品质.get("蓝器灵");
			d.本尊器灵.罡岚之灵_内防.紫器灵填充 = (float)randomRange(0,1) * d.本尊器灵.罡岚之灵_内防.品质.get("紫器灵");
			d.本尊器灵.罡岚之灵_内防.橙器灵填充 = (float)randomRange(0,1) * d.本尊器灵.罡岚之灵_内防.品质.get("橙器灵");
			
			
			//
			d.本尊器灵.离火之灵_炎焚攻击.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.本尊器灵.离火之灵_炎焚攻击.镶嵌 = (long)(d.本尊器灵.离火之灵_炎焚攻击.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.本尊器灵.离火之灵_炎焚攻击.品质.put("白器灵", (long)(d.本尊器灵.离火之灵_炎焚攻击.镶嵌 * rr[0]));
			d.本尊器灵.离火之灵_炎焚攻击.品质.put("绿器灵", (long)(d.本尊器灵.离火之灵_炎焚攻击.镶嵌 * rr[1]));
			d.本尊器灵.离火之灵_炎焚攻击.品质.put("蓝器灵", (long)(d.本尊器灵.离火之灵_炎焚攻击.镶嵌 * rr[2]));
			d.本尊器灵.离火之灵_炎焚攻击.品质.put("紫器灵", (long)(d.本尊器灵.离火之灵_炎焚攻击.镶嵌 * rr[3]));
			d.本尊器灵.离火之灵_炎焚攻击.品质.put("橙器灵", (long)(d.本尊器灵.离火之灵_炎焚攻击.镶嵌 * rr[4]));
			
			d.本尊器灵.离火之灵_炎焚攻击.白器灵填充 = (float)randomRange(0,1) * d.本尊器灵.离火之灵_炎焚攻击.品质.get("白器灵");
			d.本尊器灵.离火之灵_炎焚攻击.绿器灵填充 = (float)randomRange(0,1) * d.本尊器灵.离火之灵_炎焚攻击.品质.get("绿器灵");
			d.本尊器灵.离火之灵_炎焚攻击.蓝器灵填充 = (float)randomRange(0,1) * d.本尊器灵.离火之灵_炎焚攻击.品质.get("蓝器灵");
			d.本尊器灵.离火之灵_炎焚攻击.紫器灵填充 = (float)randomRange(0,1) * d.本尊器灵.离火之灵_炎焚攻击.品质.get("紫器灵");
			d.本尊器灵.离火之灵_炎焚攻击.橙器灵填充 = (float)randomRange(0,1) * d.本尊器灵.离火之灵_炎焚攻击.品质.get("橙器灵");
			
			
			//
			d.本尊器灵.玄冰之灵_玄冰攻击.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.本尊器灵.玄冰之灵_玄冰攻击.镶嵌 = (long)(d.本尊器灵.玄冰之灵_玄冰攻击.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.本尊器灵.玄冰之灵_玄冰攻击.品质.put("白器灵", (long)(d.本尊器灵.玄冰之灵_玄冰攻击.镶嵌 * rr[0]));
			d.本尊器灵.玄冰之灵_玄冰攻击.品质.put("绿器灵", (long)(d.本尊器灵.玄冰之灵_玄冰攻击.镶嵌 * rr[1]));
			d.本尊器灵.玄冰之灵_玄冰攻击.品质.put("蓝器灵", (long)(d.本尊器灵.玄冰之灵_玄冰攻击.镶嵌 * rr[2]));
			d.本尊器灵.玄冰之灵_玄冰攻击.品质.put("紫器灵", (long)(d.本尊器灵.玄冰之灵_玄冰攻击.镶嵌 * rr[3]));
			d.本尊器灵.玄冰之灵_玄冰攻击.品质.put("橙器灵", (long)(d.本尊器灵.玄冰之灵_玄冰攻击.镶嵌 * rr[4]));
			
			d.本尊器灵.玄冰之灵_玄冰攻击.白器灵填充 = (float)randomRange(0,1) * d.本尊器灵.玄冰之灵_玄冰攻击.品质.get("白器灵");
			d.本尊器灵.玄冰之灵_玄冰攻击.绿器灵填充 = (float)randomRange(0,1) * d.本尊器灵.玄冰之灵_玄冰攻击.品质.get("绿器灵");
			d.本尊器灵.玄冰之灵_玄冰攻击.蓝器灵填充 = (float)randomRange(0,1) * d.本尊器灵.玄冰之灵_玄冰攻击.品质.get("蓝器灵");
			d.本尊器灵.玄冰之灵_玄冰攻击.紫器灵填充 = (float)randomRange(0,1) * d.本尊器灵.玄冰之灵_玄冰攻击.品质.get("紫器灵");
			d.本尊器灵.玄冰之灵_玄冰攻击.橙器灵填充 = (float)randomRange(0,1) * d.本尊器灵.玄冰之灵_玄冰攻击.品质.get("橙器灵");
			
			
			//
			d.本尊器灵.飓风之灵_疾风攻击.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.本尊器灵.飓风之灵_疾风攻击.镶嵌 = (long)(d.本尊器灵.飓风之灵_疾风攻击.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.本尊器灵.飓风之灵_疾风攻击.品质.put("白器灵", (long)(d.本尊器灵.飓风之灵_疾风攻击.镶嵌 * rr[0]));
			d.本尊器灵.飓风之灵_疾风攻击.品质.put("绿器灵", (long)(d.本尊器灵.飓风之灵_疾风攻击.镶嵌 * rr[1]));
			d.本尊器灵.飓风之灵_疾风攻击.品质.put("蓝器灵", (long)(d.本尊器灵.飓风之灵_疾风攻击.镶嵌 * rr[2]));
			d.本尊器灵.飓风之灵_疾风攻击.品质.put("紫器灵", (long)(d.本尊器灵.飓风之灵_疾风攻击.镶嵌 * rr[3]));
			d.本尊器灵.飓风之灵_疾风攻击.品质.put("橙器灵", (long)(d.本尊器灵.飓风之灵_疾风攻击.镶嵌 * rr[4]));
			
			d.本尊器灵.飓风之灵_疾风攻击.白器灵填充 = (float)randomRange(0,1) * d.本尊器灵.飓风之灵_疾风攻击.品质.get("白器灵");
			d.本尊器灵.飓风之灵_疾风攻击.绿器灵填充 = (float)randomRange(0,1) * d.本尊器灵.飓风之灵_疾风攻击.品质.get("绿器灵");
			d.本尊器灵.飓风之灵_疾风攻击.蓝器灵填充 = (float)randomRange(0,1) * d.本尊器灵.飓风之灵_疾风攻击.品质.get("蓝器灵");
			d.本尊器灵.飓风之灵_疾风攻击.紫器灵填充 = (float)randomRange(0,1) * d.本尊器灵.飓风之灵_疾风攻击.品质.get("紫器灵");
			d.本尊器灵.飓风之灵_疾风攻击.橙器灵填充 = (float)randomRange(0,1) * d.本尊器灵.飓风之灵_疾风攻击.品质.get("橙器灵");
			
			
			//
			d.本尊器灵.惊雷之灵_狂雷攻击.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.本尊器灵.惊雷之灵_狂雷攻击.镶嵌 = (long)(d.本尊器灵.惊雷之灵_狂雷攻击.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.本尊器灵.惊雷之灵_狂雷攻击.品质.put("白器灵", (long)(d.本尊器灵.惊雷之灵_狂雷攻击.镶嵌 * rr[0]));
			d.本尊器灵.惊雷之灵_狂雷攻击.品质.put("绿器灵", (long)(d.本尊器灵.惊雷之灵_狂雷攻击.镶嵌 * rr[1]));
			d.本尊器灵.惊雷之灵_狂雷攻击.品质.put("蓝器灵", (long)(d.本尊器灵.惊雷之灵_狂雷攻击.镶嵌 * rr[2]));
			d.本尊器灵.惊雷之灵_狂雷攻击.品质.put("紫器灵", (long)(d.本尊器灵.惊雷之灵_狂雷攻击.镶嵌 * rr[3]));
			d.本尊器灵.惊雷之灵_狂雷攻击.品质.put("橙器灵", (long)(d.本尊器灵.惊雷之灵_狂雷攻击.镶嵌 * rr[4]));
			
			d.本尊器灵.惊雷之灵_狂雷攻击.白器灵填充 = (float)randomRange(0,1) * d.本尊器灵.惊雷之灵_狂雷攻击.品质.get("白器灵");
			d.本尊器灵.惊雷之灵_狂雷攻击.绿器灵填充 = (float)randomRange(0,1) * d.本尊器灵.惊雷之灵_狂雷攻击.品质.get("绿器灵");
			d.本尊器灵.惊雷之灵_狂雷攻击.蓝器灵填充 = (float)randomRange(0,1) * d.本尊器灵.惊雷之灵_狂雷攻击.品质.get("蓝器灵");
			d.本尊器灵.惊雷之灵_狂雷攻击.紫器灵填充 = (float)randomRange(0,1) * d.本尊器灵.惊雷之灵_狂雷攻击.品质.get("紫器灵");
			d.本尊器灵.惊雷之灵_狂雷攻击.橙器灵填充 = (float)randomRange(0,1) * d.本尊器灵.惊雷之灵_狂雷攻击.品质.get("橙器灵");
			
			
			//
			d.本尊器灵.御火之灵_炎焚防御.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.本尊器灵.御火之灵_炎焚防御.镶嵌 = (long)(d.本尊器灵.御火之灵_炎焚防御.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.本尊器灵.御火之灵_炎焚防御.品质.put("白器灵", (long)(d.本尊器灵.御火之灵_炎焚防御.镶嵌 * rr[0]));
			d.本尊器灵.御火之灵_炎焚防御.品质.put("绿器灵", (long)(d.本尊器灵.御火之灵_炎焚防御.镶嵌 * rr[1]));
			d.本尊器灵.御火之灵_炎焚防御.品质.put("蓝器灵", (long)(d.本尊器灵.御火之灵_炎焚防御.镶嵌 * rr[2]));
			d.本尊器灵.御火之灵_炎焚防御.品质.put("紫器灵", (long)(d.本尊器灵.御火之灵_炎焚防御.镶嵌 * rr[3]));
			d.本尊器灵.御火之灵_炎焚防御.品质.put("橙器灵", (long)(d.本尊器灵.御火之灵_炎焚防御.镶嵌 * rr[4]));
			
			d.本尊器灵.御火之灵_炎焚防御.白器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御火之灵_炎焚防御.品质.get("白器灵");
			d.本尊器灵.御火之灵_炎焚防御.绿器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御火之灵_炎焚防御.品质.get("绿器灵");
			d.本尊器灵.御火之灵_炎焚防御.蓝器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御火之灵_炎焚防御.品质.get("蓝器灵");
			d.本尊器灵.御火之灵_炎焚防御.紫器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御火之灵_炎焚防御.品质.get("紫器灵");
			d.本尊器灵.御火之灵_炎焚防御.橙器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御火之灵_炎焚防御.品质.get("橙器灵");
			
			
			//
			d.本尊器灵.御冰之灵_玄冰防御.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.本尊器灵.御冰之灵_玄冰防御.镶嵌 = (long)(d.本尊器灵.御冰之灵_玄冰防御.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.本尊器灵.御冰之灵_玄冰防御.品质.put("白器灵", (long)(d.本尊器灵.御冰之灵_玄冰防御.镶嵌 * rr[0]));
			d.本尊器灵.御冰之灵_玄冰防御.品质.put("绿器灵", (long)(d.本尊器灵.御冰之灵_玄冰防御.镶嵌 * rr[1]));
			d.本尊器灵.御冰之灵_玄冰防御.品质.put("蓝器灵", (long)(d.本尊器灵.御冰之灵_玄冰防御.镶嵌 * rr[2]));
			d.本尊器灵.御冰之灵_玄冰防御.品质.put("紫器灵", (long)(d.本尊器灵.御冰之灵_玄冰防御.镶嵌 * rr[3]));
			d.本尊器灵.御冰之灵_玄冰防御.品质.put("橙器灵", (long)(d.本尊器灵.御冰之灵_玄冰防御.镶嵌 * rr[4]));
			
			d.本尊器灵.御冰之灵_玄冰防御.白器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御冰之灵_玄冰防御.品质.get("白器灵");
			d.本尊器灵.御冰之灵_玄冰防御.绿器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御冰之灵_玄冰防御.品质.get("绿器灵");
			d.本尊器灵.御冰之灵_玄冰防御.蓝器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御冰之灵_玄冰防御.品质.get("蓝器灵");
			d.本尊器灵.御冰之灵_玄冰防御.紫器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御冰之灵_玄冰防御.品质.get("紫器灵");
			d.本尊器灵.御冰之灵_玄冰防御.橙器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御冰之灵_玄冰防御.品质.get("橙器灵");
			
			
			//
			d.本尊器灵.御风之灵_疾风防御.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.本尊器灵.御风之灵_疾风防御.镶嵌 = (long)(d.本尊器灵.御风之灵_疾风防御.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.本尊器灵.御风之灵_疾风防御.品质.put("白器灵", (long)(d.本尊器灵.御风之灵_疾风防御.镶嵌 * rr[0]));
			d.本尊器灵.御风之灵_疾风防御.品质.put("绿器灵", (long)(d.本尊器灵.御风之灵_疾风防御.镶嵌 * rr[1]));
			d.本尊器灵.御风之灵_疾风防御.品质.put("蓝器灵", (long)(d.本尊器灵.御风之灵_疾风防御.镶嵌 * rr[2]));
			d.本尊器灵.御风之灵_疾风防御.品质.put("紫器灵", (long)(d.本尊器灵.御风之灵_疾风防御.镶嵌 * rr[3]));
			d.本尊器灵.御风之灵_疾风防御.品质.put("橙器灵", (long)(d.本尊器灵.御风之灵_疾风防御.镶嵌 * rr[4]));
			
			d.本尊器灵.御风之灵_疾风防御.白器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御风之灵_疾风防御.品质.get("白器灵");
			d.本尊器灵.御风之灵_疾风防御.绿器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御风之灵_疾风防御.品质.get("绿器灵");
			d.本尊器灵.御风之灵_疾风防御.蓝器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御风之灵_疾风防御.品质.get("蓝器灵");
			d.本尊器灵.御风之灵_疾风防御.紫器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御风之灵_疾风防御.品质.get("紫器灵");
			d.本尊器灵.御风之灵_疾风防御.橙器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御风之灵_疾风防御.品质.get("橙器灵");
			
			
			//
			d.本尊器灵.御雷之灵_狂雷防御.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.本尊器灵.御雷之灵_狂雷防御.镶嵌 = (long)(d.本尊器灵.御雷之灵_狂雷防御.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.本尊器灵.御雷之灵_狂雷防御.品质.put("白器灵", (long)(d.本尊器灵.御雷之灵_狂雷防御.镶嵌 * rr[0]));
			d.本尊器灵.御雷之灵_狂雷防御.品质.put("绿器灵", (long)(d.本尊器灵.御雷之灵_狂雷防御.镶嵌 * rr[1]));
			d.本尊器灵.御雷之灵_狂雷防御.品质.put("蓝器灵", (long)(d.本尊器灵.御雷之灵_狂雷防御.镶嵌 * rr[2]));
			d.本尊器灵.御雷之灵_狂雷防御.品质.put("紫器灵", (long)(d.本尊器灵.御雷之灵_狂雷防御.镶嵌 * rr[3]));
			d.本尊器灵.御雷之灵_狂雷防御.品质.put("橙器灵", (long)(d.本尊器灵.御雷之灵_狂雷防御.镶嵌 * rr[4]));
			
			d.本尊器灵.御雷之灵_狂雷防御.白器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御雷之灵_狂雷防御.品质.get("白器灵");
			d.本尊器灵.御雷之灵_狂雷防御.绿器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御雷之灵_狂雷防御.品质.get("绿器灵");
			d.本尊器灵.御雷之灵_狂雷防御.蓝器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御雷之灵_狂雷防御.品质.get("蓝器灵");
			d.本尊器灵.御雷之灵_狂雷防御.紫器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御雷之灵_狂雷防御.品质.get("紫器灵");
			d.本尊器灵.御雷之灵_狂雷防御.橙器灵填充 = (float)randomRange(0,1) * d.本尊器灵.御雷之灵_狂雷防御.品质.get("橙器灵");
			
			
			/////
			
			d.本尊坐骑.坐骑数量 = (long)(d.人数 * randomRange(0.6,1));
			
			//
			d.本尊坐骑.面甲.数量 = (long)(d.本尊坐骑.坐骑数量 * randomRange(0.6,1));
			d.本尊坐骑.面甲.强化 = (long)(d.本尊坐骑.面甲.数量 * 20 * randomRange(0.6,1));
			
			rr = randomDistribute(7);
			d.本尊坐骑.面甲.颜色.put("白", (long)(rr[0] * d.本尊坐骑.面甲.数量));
			d.本尊坐骑.面甲.颜色.put("绿", (long)(rr[1] * d.本尊坐骑.面甲.数量));
			d.本尊坐骑.面甲.颜色.put("蓝", (long)(rr[2] * d.本尊坐骑.面甲.数量));
			d.本尊坐骑.面甲.颜色.put("紫", (long)(rr[3] * d.本尊坐骑.面甲.数量));
			d.本尊坐骑.面甲.颜色.put("完美紫", (long)(rr[4] * d.本尊坐骑.面甲.数量));
			d.本尊坐骑.面甲.颜色.put("橙", (long)(rr[5] * d.本尊坐骑.面甲.数量));
			d.本尊坐骑.面甲.颜色.put("完美橙", (long)(rr[6] * d.本尊坐骑.面甲.数量));
			
			//
			d.本尊坐骑.颈甲.数量 = (long)(d.本尊坐骑.坐骑数量 * randomRange(0.6,1));
			d.本尊坐骑.颈甲.强化 = (long)(d.本尊坐骑.颈甲.数量 * 20 * randomRange(0.6,1));
			
			rr = randomDistribute(7);
			d.本尊坐骑.颈甲.颜色.put("白", (long)(rr[0] * d.本尊坐骑.颈甲.数量));
			d.本尊坐骑.颈甲.颜色.put("绿", (long)(rr[1] * d.本尊坐骑.颈甲.数量));
			d.本尊坐骑.颈甲.颜色.put("蓝", (long)(rr[2] * d.本尊坐骑.颈甲.数量));
			d.本尊坐骑.颈甲.颜色.put("紫", (long)(rr[3] * d.本尊坐骑.颈甲.数量));
			d.本尊坐骑.颈甲.颜色.put("完美紫", (long)(rr[4] * d.本尊坐骑.颈甲.数量));
			d.本尊坐骑.颈甲.颜色.put("橙", (long)(rr[5] * d.本尊坐骑.颈甲.数量));
			d.本尊坐骑.颈甲.颜色.put("完美橙", (long)(rr[6] * d.本尊坐骑.颈甲.数量));
			
			//
			d.本尊坐骑.体铠.数量 = (long)(d.本尊坐骑.坐骑数量 * randomRange(0.6,1));
			d.本尊坐骑.体铠.强化 = (long)(d.本尊坐骑.体铠.数量 * 20 * randomRange(0.6,1));
			
			rr = randomDistribute(7);
			d.本尊坐骑.体铠.颜色.put("白", (long)(rr[0] * d.本尊坐骑.体铠.数量));
			d.本尊坐骑.体铠.颜色.put("绿", (long)(rr[1] * d.本尊坐骑.体铠.数量));
			d.本尊坐骑.体铠.颜色.put("蓝", (long)(rr[2] * d.本尊坐骑.体铠.数量));
			d.本尊坐骑.体铠.颜色.put("紫", (long)(rr[3] * d.本尊坐骑.体铠.数量));
			d.本尊坐骑.体铠.颜色.put("完美紫", (long)(rr[4] * d.本尊坐骑.体铠.数量));
			d.本尊坐骑.体铠.颜色.put("橙", (long)(rr[5] * d.本尊坐骑.体铠.数量));
			d.本尊坐骑.体铠.颜色.put("完美橙", (long)(rr[6] * d.本尊坐骑.体铠.数量));
			
			//
			d.本尊坐骑.鞍铠.数量 = (long)(d.本尊坐骑.坐骑数量 * randomRange(0.6,1));
			d.本尊坐骑.鞍铠.强化 = (long)(d.本尊坐骑.鞍铠.数量 * 20 * randomRange(0.6,1));
			
			rr = randomDistribute(7);
			d.本尊坐骑.鞍铠.颜色.put("白", (long)(rr[0] * d.本尊坐骑.鞍铠.数量));
			d.本尊坐骑.鞍铠.颜色.put("绿", (long)(rr[1] * d.本尊坐骑.鞍铠.数量));
			d.本尊坐骑.鞍铠.颜色.put("蓝", (long)(rr[2] * d.本尊坐骑.鞍铠.数量));
			d.本尊坐骑.鞍铠.颜色.put("紫", (long)(rr[3] * d.本尊坐骑.鞍铠.数量));
			d.本尊坐骑.鞍铠.颜色.put("完美紫", (long)(rr[4] * d.本尊坐骑.鞍铠.数量));
			d.本尊坐骑.鞍铠.颜色.put("橙", (long)(rr[5] * d.本尊坐骑.鞍铠.数量));
			d.本尊坐骑.鞍铠.颜色.put("完美橙", (long)(rr[6] * d.本尊坐骑.鞍铠.数量));
			
			//
			d.本尊坐骑.蹄甲.数量 = (long)(d.本尊坐骑.坐骑数量 * randomRange(0.6,1));
			d.本尊坐骑.蹄甲.强化 = (long)(d.本尊坐骑.蹄甲.数量 * 20 * randomRange(0.6,1));
			
			rr = randomDistribute(7);
			d.本尊坐骑.蹄甲.颜色.put("白", (long)(rr[0] * d.本尊坐骑.蹄甲.数量));
			d.本尊坐骑.蹄甲.颜色.put("绿", (long)(rr[1] * d.本尊坐骑.蹄甲.数量));
			d.本尊坐骑.蹄甲.颜色.put("蓝", (long)(rr[2] * d.本尊坐骑.蹄甲.数量));
			d.本尊坐骑.蹄甲.颜色.put("紫", (long)(rr[3] * d.本尊坐骑.蹄甲.数量));
			d.本尊坐骑.蹄甲.颜色.put("完美紫", (long)(rr[4] * d.本尊坐骑.蹄甲.数量));
			d.本尊坐骑.蹄甲.颜色.put("橙", (long)(rr[5] * d.本尊坐骑.蹄甲.数量));
			d.本尊坐骑.蹄甲.颜色.put("完美橙", (long)(rr[6] * d.本尊坐骑.蹄甲.数量));
			
			
			////////////////////////////////////////////////////////////////////////
			
			d.元神装备.武器.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.元神装备.武器.等级 = d.元神装备.武器.数量 * (50+i/2);
			d.元神装备.武器.星级 = d.元神装备.武器.数量 * (1 + i/13);
			d.元神装备.武器.铭刻 = (long)(d.元神装备.武器.数量 * randomRange(0.8,1.0));
			
			 rr = randomDistribute(7);
			d.元神装备.武器.颜色.put("白", 		(long)(rr[0]*d.元神装备.武器.数量));
			d.元神装备.武器.颜色.put("绿", 		(long)(rr[1]*d.元神装备.武器.数量));
			d.元神装备.武器.颜色.put("蓝", 		(long)(rr[2]*d.元神装备.武器.数量));
			d.元神装备.武器.颜色.put("紫", 		(long)(rr[3]*d.元神装备.武器.数量));
			d.元神装备.武器.颜色.put("完美紫", 	(long)(rr[4]*d.元神装备.武器.数量));
			d.元神装备.武器.颜色.put("橙", 		(long)(rr[5]*d.元神装备.武器.数量));
			d.元神装备.武器.颜色.put("完美橙", 	(long)(rr[6]*d.元神装备.武器.数量));
			
			rr = randomDistribute(8);
			d.元神装备.武器.鉴定.put("普通", 		(long)(rr[0]*d.元神装备.武器.数量));
			d.元神装备.武器.鉴定.put("一般", 		(long)(rr[1]*d.元神装备.武器.数量));
			d.元神装备.武器.鉴定.put("优秀", 		(long)(rr[2]*d.元神装备.武器.数量));
			d.元神装备.武器.鉴定.put("卓越", 		(long)(rr[3]*d.元神装备.武器.数量));
			d.元神装备.武器.鉴定.put("完美", 		(long)(rr[4]*d.元神装备.武器.数量));
			d.元神装备.武器.鉴定.put("传奇", 		(long)(rr[5]*d.元神装备.武器.数量));
			d.元神装备.武器.鉴定.put("传说", 		(long)(rr[6]*d.元神装备.武器.数量));
			d.元神装备.武器.鉴定.put("神话", 		(long)(rr[7]*d.元神装备.武器.数量));
			
			//
			d.元神装备.头部.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.元神装备.头部.等级 = d.元神装备.头部.数量 * (50+i/2);
			d.元神装备.头部.星级 = d.元神装备.头部.数量 * (1 + i/13);
			d.元神装备.头部.铭刻 = (long)(d.元神装备.头部.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.元神装备.头部.颜色.put("白", 		(long)(rr[0]*d.元神装备.头部.数量));
			d.元神装备.头部.颜色.put("绿", 		(long)(rr[1]*d.元神装备.头部.数量));
			d.元神装备.头部.颜色.put("蓝", 		(long)(rr[2]*d.元神装备.头部.数量));
			d.元神装备.头部.颜色.put("紫", 		(long)(rr[3]*d.元神装备.头部.数量));
			d.元神装备.头部.颜色.put("完美紫", 	(long)(rr[4]*d.元神装备.头部.数量));
			d.元神装备.头部.颜色.put("橙", 		(long)(rr[5]*d.元神装备.头部.数量));
			d.元神装备.头部.颜色.put("完美橙", 	(long)(rr[6]*d.元神装备.头部.数量));
			
			rr = randomDistribute(8);
			d.元神装备.头部.鉴定.put("普通", 		(long)(rr[0]*d.元神装备.头部.数量));
			d.元神装备.头部.鉴定.put("一般", 		(long)(rr[1]*d.元神装备.头部.数量));
			d.元神装备.头部.鉴定.put("优秀", 		(long)(rr[2]*d.元神装备.头部.数量));
			d.元神装备.头部.鉴定.put("卓越", 		(long)(rr[3]*d.元神装备.头部.数量));
			d.元神装备.头部.鉴定.put("完美", 		(long)(rr[4]*d.元神装备.头部.数量));
			d.元神装备.头部.鉴定.put("传奇", 		(long)(rr[5]*d.元神装备.头部.数量));
			d.元神装备.头部.鉴定.put("传说", 		(long)(rr[6]*d.元神装备.头部.数量));
			d.元神装备.头部.鉴定.put("神话", 		(long)(rr[7]*d.元神装备.头部.数量));
			
			//
			d.元神装备.饰品.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.元神装备.饰品.等级 = d.元神装备.饰品.数量 * (50+i/2);
			d.元神装备.饰品.星级 = d.元神装备.饰品.数量 * (1 + i/13);
			d.元神装备.饰品.铭刻 = (long)(d.元神装备.饰品.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.元神装备.饰品.颜色.put("白", 		(long)(rr[0]*d.元神装备.饰品.数量));
			d.元神装备.饰品.颜色.put("绿", 		(long)(rr[1]*d.元神装备.饰品.数量));
			d.元神装备.饰品.颜色.put("蓝", 		(long)(rr[2]*d.元神装备.饰品.数量));
			d.元神装备.饰品.颜色.put("紫", 		(long)(rr[3]*d.元神装备.饰品.数量));
			d.元神装备.饰品.颜色.put("完美紫", 	(long)(rr[4]*d.元神装备.饰品.数量));
			d.元神装备.饰品.颜色.put("橙", 		(long)(rr[5]*d.元神装备.饰品.数量));
			d.元神装备.饰品.颜色.put("完美橙", 	(long)(rr[6]*d.元神装备.饰品.数量));
			
			rr = randomDistribute(8);
			d.元神装备.饰品.鉴定.put("普通", 		(long)(rr[0]*d.元神装备.饰品.数量));
			d.元神装备.饰品.鉴定.put("一般", 		(long)(rr[1]*d.元神装备.饰品.数量));
			d.元神装备.饰品.鉴定.put("优秀", 		(long)(rr[2]*d.元神装备.饰品.数量));
			d.元神装备.饰品.鉴定.put("卓越", 		(long)(rr[3]*d.元神装备.饰品.数量));
			d.元神装备.饰品.鉴定.put("完美", 		(long)(rr[4]*d.元神装备.饰品.数量));
			d.元神装备.饰品.鉴定.put("传奇", 		(long)(rr[5]*d.元神装备.饰品.数量));
			d.元神装备.饰品.鉴定.put("传说", 		(long)(rr[6]*d.元神装备.饰品.数量));
			d.元神装备.饰品.鉴定.put("神话", 		(long)(rr[7]*d.元神装备.饰品.数量));
			
			//
			d.元神装备.腰带.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.元神装备.腰带.等级 = d.元神装备.腰带.数量 * (50+i/2);
			d.元神装备.腰带.星级 = d.元神装备.腰带.数量 * (1 + i/13);
			d.元神装备.腰带.铭刻 = (long)(d.元神装备.腰带.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.元神装备.腰带.颜色.put("白", 		(long)(rr[0]*d.元神装备.腰带.数量));
			d.元神装备.腰带.颜色.put("绿", 		(long)(rr[1]*d.元神装备.腰带.数量));
			d.元神装备.腰带.颜色.put("蓝", 		(long)(rr[2]*d.元神装备.腰带.数量));
			d.元神装备.腰带.颜色.put("紫", 		(long)(rr[3]*d.元神装备.腰带.数量));
			d.元神装备.腰带.颜色.put("完美紫", 	(long)(rr[4]*d.元神装备.腰带.数量));
			d.元神装备.腰带.颜色.put("橙", 		(long)(rr[5]*d.元神装备.腰带.数量));
			d.元神装备.腰带.颜色.put("完美橙", 	(long)(rr[6]*d.元神装备.腰带.数量));
			
			rr = randomDistribute(8);
			d.元神装备.腰带.鉴定.put("普通", 		(long)(rr[0]*d.元神装备.腰带.数量));
			d.元神装备.腰带.鉴定.put("一般", 		(long)(rr[1]*d.元神装备.腰带.数量));
			d.元神装备.腰带.鉴定.put("优秀", 		(long)(rr[2]*d.元神装备.腰带.数量));
			d.元神装备.腰带.鉴定.put("卓越", 		(long)(rr[3]*d.元神装备.腰带.数量));
			d.元神装备.腰带.鉴定.put("完美", 		(long)(rr[4]*d.元神装备.腰带.数量));
			d.元神装备.腰带.鉴定.put("传奇", 		(long)(rr[5]*d.元神装备.腰带.数量));
			d.元神装备.腰带.鉴定.put("传说", 		(long)(rr[6]*d.元神装备.腰带.数量));
			d.元神装备.腰带.鉴定.put("神话", 		(long)(rr[7]*d.元神装备.腰带.数量));
			
			//
			d.元神装备.项链.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.元神装备.项链.等级 = d.元神装备.项链.数量 * (50+i/2);
			d.元神装备.项链.星级 = d.元神装备.项链.数量 * (1 + i/13);
			d.元神装备.项链.铭刻 = (long)(d.元神装备.项链.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.元神装备.项链.颜色.put("白", 		(long)(rr[0]*d.元神装备.项链.数量));
			d.元神装备.项链.颜色.put("绿", 		(long)(rr[1]*d.元神装备.项链.数量));
			d.元神装备.项链.颜色.put("蓝", 		(long)(rr[2]*d.元神装备.项链.数量));
			d.元神装备.项链.颜色.put("紫", 		(long)(rr[3]*d.元神装备.项链.数量));
			d.元神装备.项链.颜色.put("完美紫", 	(long)(rr[4]*d.元神装备.项链.数量));
			d.元神装备.项链.颜色.put("橙", 		(long)(rr[5]*d.元神装备.项链.数量));
			d.元神装备.项链.颜色.put("完美橙", 	(long)(rr[6]*d.元神装备.项链.数量));
			
			rr = randomDistribute(8);
			d.元神装备.项链.鉴定.put("普通", 		(long)(rr[0]*d.元神装备.项链.数量));
			d.元神装备.项链.鉴定.put("一般", 		(long)(rr[1]*d.元神装备.项链.数量));
			d.元神装备.项链.鉴定.put("优秀", 		(long)(rr[2]*d.元神装备.项链.数量));
			d.元神装备.项链.鉴定.put("卓越", 		(long)(rr[3]*d.元神装备.项链.数量));
			d.元神装备.项链.鉴定.put("完美", 		(long)(rr[4]*d.元神装备.项链.数量));
			d.元神装备.项链.鉴定.put("传奇", 		(long)(rr[5]*d.元神装备.项链.数量));
			d.元神装备.项链.鉴定.put("传说", 		(long)(rr[6]*d.元神装备.项链.数量));
			d.元神装备.项链.鉴定.put("神话", 		(long)(rr[7]*d.元神装备.项链.数量));
			
			//
			d.元神装备.鞋子.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.元神装备.鞋子.等级 = d.元神装备.鞋子.数量 * (50+i/2);
			d.元神装备.鞋子.星级 = d.元神装备.鞋子.数量 * (1 + i/13);
			d.元神装备.鞋子.铭刻 = (long)(d.元神装备.鞋子.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.元神装备.鞋子.颜色.put("白", 		(long)(rr[0]*d.元神装备.鞋子.数量));
			d.元神装备.鞋子.颜色.put("绿", 		(long)(rr[1]*d.元神装备.鞋子.数量));
			d.元神装备.鞋子.颜色.put("蓝", 		(long)(rr[2]*d.元神装备.鞋子.数量));
			d.元神装备.鞋子.颜色.put("紫", 		(long)(rr[3]*d.元神装备.鞋子.数量));
			d.元神装备.鞋子.颜色.put("完美紫", 	(long)(rr[4]*d.元神装备.鞋子.数量));
			d.元神装备.鞋子.颜色.put("橙", 		(long)(rr[5]*d.元神装备.鞋子.数量));
			d.元神装备.鞋子.颜色.put("完美橙", 	(long)(rr[6]*d.元神装备.鞋子.数量));
			
			rr = randomDistribute(8);
			d.元神装备.鞋子.鉴定.put("普通", 		(long)(rr[0]*d.元神装备.鞋子.数量));
			d.元神装备.鞋子.鉴定.put("一般", 		(long)(rr[1]*d.元神装备.鞋子.数量));
			d.元神装备.鞋子.鉴定.put("优秀", 		(long)(rr[2]*d.元神装备.鞋子.数量));
			d.元神装备.鞋子.鉴定.put("卓越", 		(long)(rr[3]*d.元神装备.鞋子.数量));
			d.元神装备.鞋子.鉴定.put("完美", 		(long)(rr[4]*d.元神装备.鞋子.数量));
			d.元神装备.鞋子.鉴定.put("传奇", 		(long)(rr[5]*d.元神装备.鞋子.数量));
			d.元神装备.鞋子.鉴定.put("传说", 		(long)(rr[6]*d.元神装备.鞋子.数量));
			d.元神装备.鞋子.鉴定.put("神话", 		(long)(rr[7]*d.元神装备.鞋子.数量));
			
			//
			d.元神装备.戒指.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.元神装备.戒指.等级 = d.元神装备.戒指.数量 * (50+i/2);
			d.元神装备.戒指.星级 = d.元神装备.戒指.数量 * (1 + i/13);
			d.元神装备.戒指.铭刻 = (long)(d.元神装备.戒指.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.元神装备.戒指.颜色.put("白", 		(long)(rr[0]*d.元神装备.戒指.数量));
			d.元神装备.戒指.颜色.put("绿", 		(long)(rr[1]*d.元神装备.戒指.数量));
			d.元神装备.戒指.颜色.put("蓝", 		(long)(rr[2]*d.元神装备.戒指.数量));
			d.元神装备.戒指.颜色.put("紫", 		(long)(rr[3]*d.元神装备.戒指.数量));
			d.元神装备.戒指.颜色.put("完美紫", 	(long)(rr[4]*d.元神装备.戒指.数量));
			d.元神装备.戒指.颜色.put("橙", 		(long)(rr[5]*d.元神装备.戒指.数量));
			d.元神装备.戒指.颜色.put("完美橙", 	(long)(rr[6]*d.元神装备.戒指.数量));
			
			rr = randomDistribute(8);
			d.元神装备.戒指.鉴定.put("普通", 		(long)(rr[0]*d.元神装备.戒指.数量));
			d.元神装备.戒指.鉴定.put("一般", 		(long)(rr[1]*d.元神装备.戒指.数量));
			d.元神装备.戒指.鉴定.put("优秀", 		(long)(rr[2]*d.元神装备.戒指.数量));
			d.元神装备.戒指.鉴定.put("卓越", 		(long)(rr[3]*d.元神装备.戒指.数量));
			d.元神装备.戒指.鉴定.put("完美", 		(long)(rr[4]*d.元神装备.戒指.数量));
			d.元神装备.戒指.鉴定.put("传奇", 		(long)(rr[5]*d.元神装备.戒指.数量));
			d.元神装备.戒指.鉴定.put("传说", 		(long)(rr[6]*d.元神装备.戒指.数量));
			d.元神装备.戒指.鉴定.put("神话", 		(long)(rr[7]*d.元神装备.戒指.数量));
			
			//
			d.元神装备.护腕.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.元神装备.护腕.等级 = d.元神装备.护腕.数量 * (50+i/2);
			d.元神装备.护腕.星级 = d.元神装备.护腕.数量 * (1 + i/13);
			d.元神装备.护腕.铭刻 = (long)(d.元神装备.护腕.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.元神装备.护腕.颜色.put("白", 		(long)(rr[0]*d.元神装备.护腕.数量));
			d.元神装备.护腕.颜色.put("绿", 		(long)(rr[1]*d.元神装备.护腕.数量));
			d.元神装备.护腕.颜色.put("蓝", 		(long)(rr[2]*d.元神装备.护腕.数量));
			d.元神装备.护腕.颜色.put("紫", 		(long)(rr[3]*d.元神装备.护腕.数量));
			d.元神装备.护腕.颜色.put("完美紫", 	(long)(rr[4]*d.元神装备.护腕.数量));
			d.元神装备.护腕.颜色.put("橙", 		(long)(rr[5]*d.元神装备.护腕.数量));
			d.元神装备.护腕.颜色.put("完美橙", 	(long)(rr[6]*d.元神装备.护腕.数量));
			
			rr = randomDistribute(8);
			d.元神装备.护腕.鉴定.put("普通", 		(long)(rr[0]*d.元神装备.护腕.数量));
			d.元神装备.护腕.鉴定.put("一般", 		(long)(rr[1]*d.元神装备.护腕.数量));
			d.元神装备.护腕.鉴定.put("优秀", 		(long)(rr[2]*d.元神装备.护腕.数量));
			d.元神装备.护腕.鉴定.put("卓越", 		(long)(rr[3]*d.元神装备.护腕.数量));
			d.元神装备.护腕.鉴定.put("完美", 		(long)(rr[4]*d.元神装备.护腕.数量));
			d.元神装备.护腕.鉴定.put("传奇", 		(long)(rr[5]*d.元神装备.护腕.数量));
			d.元神装备.护腕.鉴定.put("传说", 		(long)(rr[6]*d.元神装备.护腕.数量));
			d.元神装备.护腕.鉴定.put("神话", 		(long)(rr[7]*d.元神装备.护腕.数量));
			
			//
			d.元神装备.肩部.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.元神装备.肩部.等级 = d.元神装备.肩部.数量 * (50+i/2);
			d.元神装备.肩部.星级 = d.元神装备.肩部.数量 * (1 + i/13);
			d.元神装备.肩部.铭刻 = (long)(d.元神装备.肩部.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.元神装备.肩部.颜色.put("白", 		(long)(rr[0]*d.元神装备.肩部.数量));
			d.元神装备.肩部.颜色.put("绿", 		(long)(rr[1]*d.元神装备.肩部.数量));
			d.元神装备.肩部.颜色.put("蓝", 		(long)(rr[2]*d.元神装备.肩部.数量));
			d.元神装备.肩部.颜色.put("紫", 		(long)(rr[3]*d.元神装备.肩部.数量));
			d.元神装备.肩部.颜色.put("完美紫", 	(long)(rr[4]*d.元神装备.肩部.数量));
			d.元神装备.肩部.颜色.put("橙", 		(long)(rr[5]*d.元神装备.肩部.数量));
			d.元神装备.肩部.颜色.put("完美橙", 	(long)(rr[6]*d.元神装备.肩部.数量));
			
			rr = randomDistribute(8);
			d.元神装备.肩部.鉴定.put("普通", 		(long)(rr[0]*d.元神装备.肩部.数量));
			d.元神装备.肩部.鉴定.put("一般", 		(long)(rr[1]*d.元神装备.肩部.数量));
			d.元神装备.肩部.鉴定.put("优秀", 		(long)(rr[2]*d.元神装备.肩部.数量));
			d.元神装备.肩部.鉴定.put("卓越", 		(long)(rr[3]*d.元神装备.肩部.数量));
			d.元神装备.肩部.鉴定.put("完美", 		(long)(rr[4]*d.元神装备.肩部.数量));
			d.元神装备.肩部.鉴定.put("传奇", 		(long)(rr[5]*d.元神装备.肩部.数量));
			d.元神装备.肩部.鉴定.put("传说", 		(long)(rr[6]*d.元神装备.肩部.数量));
			d.元神装备.肩部.鉴定.put("神话", 		(long)(rr[7]*d.元神装备.肩部.数量));
			
			//
			d.元神装备.胸部.数量 = (long)(d.人数 * randomRange(0.8,1.0));
			d.元神装备.胸部.等级 = d.元神装备.胸部.数量 * (50+i/2);
			d.元神装备.胸部.星级 = d.元神装备.胸部.数量 * (1 + i/13);
			d.元神装备.胸部.铭刻 = (long)(d.元神装备.胸部.数量 * randomRange(0.8,1.0));
			
			rr = randomDistribute(7);
			d.元神装备.胸部.颜色.put("白", 		(long)(rr[0]*d.元神装备.胸部.数量));
			d.元神装备.胸部.颜色.put("绿", 		(long)(rr[1]*d.元神装备.胸部.数量));
			d.元神装备.胸部.颜色.put("蓝", 		(long)(rr[2]*d.元神装备.胸部.数量));
			d.元神装备.胸部.颜色.put("紫", 		(long)(rr[3]*d.元神装备.胸部.数量));
			d.元神装备.胸部.颜色.put("完美紫", 	(long)(rr[4]*d.元神装备.胸部.数量));
			d.元神装备.胸部.颜色.put("橙", 		(long)(rr[5]*d.元神装备.胸部.数量));
			d.元神装备.胸部.颜色.put("完美橙", 	(long)(rr[6]*d.元神装备.胸部.数量));
			
			rr = randomDistribute(8);
			d.元神装备.胸部.鉴定.put("普通", 		(long)(rr[0]*d.元神装备.胸部.数量));
			d.元神装备.胸部.鉴定.put("一般", 		(long)(rr[1]*d.元神装备.胸部.数量));
			d.元神装备.胸部.鉴定.put("优秀", 		(long)(rr[2]*d.元神装备.胸部.数量));
			d.元神装备.胸部.鉴定.put("卓越", 		(long)(rr[3]*d.元神装备.胸部.数量));
			d.元神装备.胸部.鉴定.put("完美", 		(long)(rr[4]*d.元神装备.胸部.数量));
			d.元神装备.胸部.鉴定.put("传奇", 		(long)(rr[5]*d.元神装备.胸部.数量));
			d.元神装备.胸部.鉴定.put("传说", 		(long)(rr[6]*d.元神装备.胸部.数量));
			d.元神装备.胸部.鉴定.put("神话", 		(long)(rr[7]*d.元神装备.胸部.数量));
			
			
			
			//
			d.元神宝石.宝石竹清.孔数 = (long)(d.人数 * randomRange(2,3));
			d.元神宝石.宝石竹清.镶嵌 = (long)(d.元神宝石.宝石竹清.孔数 * randomRange(0.5,1.0));
			d.元神宝石.宝石竹清.等级 = (long)(d.元神宝石.宝石竹清.镶嵌 * randomRange(1,9));
			
			//
			d.元神宝石.宝石枳香.孔数 = (long)(d.人数 * randomRange(2,3));
			d.元神宝石.宝石枳香.镶嵌 = (long)(d.元神宝石.宝石枳香.孔数 * randomRange(0.5,1.0));
			d.元神宝石.宝石枳香.等级 = (long)(d.元神宝石.宝石枳香.镶嵌 * randomRange(1,9));
			
			//
			d.元神宝石.宝石幽橘.孔数 = (long)(d.人数 * randomRange(2,3));
			d.元神宝石.宝石幽橘.镶嵌 = (long)(d.元神宝石.宝石幽橘.孔数 * randomRange(0.5,1.0));
			d.元神宝石.宝石幽橘.等级 = (long)(d.元神宝石.宝石幽橘.镶嵌 * randomRange(1,9));
			
			//
			d.元神宝石.宝石湛天.孔数 = (long)(d.人数 * randomRange(2,3));
			d.元神宝石.宝石湛天.镶嵌 = (long)(d.元神宝石.宝石湛天.孔数 * randomRange(0.5,1.0));
			d.元神宝石.宝石湛天.等级 = (long)(d.元神宝石.宝石湛天.镶嵌 * randomRange(1,9));
			
			//
			d.元神宝石.宝石墨轮.孔数 = (long)(d.人数 * randomRange(2,3));
			d.元神宝石.宝石墨轮.镶嵌 = (long)(d.元神宝石.宝石墨轮.孔数 * randomRange(0.5,1.0));
			d.元神宝石.宝石墨轮.等级 = (long)(d.元神宝石.宝石墨轮.镶嵌 * randomRange(1,9));
			
			//
			d.元神宝石.宝石炎焚.孔数 = (long)(d.人数 * randomRange(2,3));
			d.元神宝石.宝石炎焚.镶嵌 = (long)(d.元神宝石.宝石炎焚.孔数 * randomRange(0.5,1.0));
			d.元神宝石.宝石炎焚.等级 = (long)(d.元神宝石.宝石炎焚.镶嵌 * randomRange(1,9));
			
			//
			d.元神宝石.宝石无相.孔数 = (long)(d.人数 * randomRange(2,3));
			d.元神宝石.宝石无相.镶嵌 = (long)(d.元神宝石.宝石无相.孔数 * randomRange(0.5,1.0));
			d.元神宝石.宝石无相.等级 = (long)(d.元神宝石.宝石无相.镶嵌 * randomRange(1,9));
			
			//
			d.元神宝石.宝石魔渊.孔数 = (long)(d.人数 * randomRange(2,3));
			d.元神宝石.宝石魔渊.镶嵌 = (long)(d.元神宝石.宝石魔渊.孔数 * randomRange(0.5,1.0));
			d.元神宝石.宝石魔渊.等级 = (long)(d.元神宝石.宝石魔渊.镶嵌 * randomRange(1,9));
			
			//
			d.元神宝石.宝石混沌.孔数 = (long)(d.人数 * randomRange(2,3));
			d.元神宝石.宝石混沌.镶嵌 = (long)(d.元神宝石.宝石混沌.孔数 * randomRange(0.5,1.0));
			d.元神宝石.宝石混沌.等级 = (long)(d.元神宝石.宝石混沌.镶嵌 * randomRange(1,9));
			
			
			
			//
			d.元神器灵.长生之灵_生命.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.元神器灵.长生之灵_生命.镶嵌 = (long)(d.元神器灵.长生之灵_生命.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.元神器灵.长生之灵_生命.品质.put("白器灵", (long)(d.元神器灵.长生之灵_生命.镶嵌 * rr[0]));
			d.元神器灵.长生之灵_生命.品质.put("绿器灵", (long)(d.元神器灵.长生之灵_生命.镶嵌 * rr[1]));
			d.元神器灵.长生之灵_生命.品质.put("蓝器灵", (long)(d.元神器灵.长生之灵_生命.镶嵌 * rr[2]));
			d.元神器灵.长生之灵_生命.品质.put("紫器灵", (long)(d.元神器灵.长生之灵_生命.镶嵌 * rr[3]));
			d.元神器灵.长生之灵_生命.品质.put("橙器灵", (long)(d.元神器灵.长生之灵_生命.镶嵌 * rr[4]));
			
			d.元神器灵.长生之灵_生命.白器灵填充 = (float)randomRange(0,1) * d.元神器灵.长生之灵_生命.品质.get("白器灵");
			d.元神器灵.长生之灵_生命.绿器灵填充 = (float)randomRange(0,1) * d.元神器灵.长生之灵_生命.品质.get("绿器灵");
			d.元神器灵.长生之灵_生命.蓝器灵填充 = (float)randomRange(0,1) * d.元神器灵.长生之灵_生命.品质.get("蓝器灵");
			d.元神器灵.长生之灵_生命.紫器灵填充 = (float)randomRange(0,1) * d.元神器灵.长生之灵_生命.品质.get("紫器灵");
			d.元神器灵.长生之灵_生命.橙器灵填充 = (float)randomRange(0,1) * d.元神器灵.长生之灵_生命.品质.get("橙器灵");
			
			//
			d.元神器灵.擎天之灵_外攻.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.元神器灵.擎天之灵_外攻.镶嵌 = (long)(d.元神器灵.擎天之灵_外攻.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.元神器灵.擎天之灵_外攻.品质.put("白器灵", (long)(d.元神器灵.擎天之灵_外攻.镶嵌 * rr[0]));
			d.元神器灵.擎天之灵_外攻.品质.put("绿器灵", (long)(d.元神器灵.擎天之灵_外攻.镶嵌 * rr[1]));
			d.元神器灵.擎天之灵_外攻.品质.put("蓝器灵", (long)(d.元神器灵.擎天之灵_外攻.镶嵌 * rr[2]));
			d.元神器灵.擎天之灵_外攻.品质.put("紫器灵", (long)(d.元神器灵.擎天之灵_外攻.镶嵌 * rr[3]));
			d.元神器灵.擎天之灵_外攻.品质.put("橙器灵", (long)(d.元神器灵.擎天之灵_外攻.镶嵌 * rr[4]));
			
			d.元神器灵.擎天之灵_外攻.白器灵填充 = (float)randomRange(0,1) * d.元神器灵.擎天之灵_外攻.品质.get("白器灵");
			d.元神器灵.擎天之灵_外攻.绿器灵填充 = (float)randomRange(0,1) * d.元神器灵.擎天之灵_外攻.品质.get("绿器灵");
			d.元神器灵.擎天之灵_外攻.蓝器灵填充 = (float)randomRange(0,1) * d.元神器灵.擎天之灵_外攻.品质.get("蓝器灵");
			d.元神器灵.擎天之灵_外攻.紫器灵填充 = (float)randomRange(0,1) * d.元神器灵.擎天之灵_外攻.品质.get("紫器灵");
			d.元神器灵.擎天之灵_外攻.橙器灵填充 = (float)randomRange(0,1) * d.元神器灵.擎天之灵_外攻.品质.get("橙器灵");
			
			
			//
			d.元神器灵.琼浆之灵_内法.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.元神器灵.琼浆之灵_内法.镶嵌 = (long)(d.元神器灵.琼浆之灵_内法.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.元神器灵.琼浆之灵_内法.品质.put("白器灵", (long)(d.元神器灵.琼浆之灵_内法.镶嵌 * rr[0]));
			d.元神器灵.琼浆之灵_内法.品质.put("绿器灵", (long)(d.元神器灵.琼浆之灵_内法.镶嵌 * rr[1]));
			d.元神器灵.琼浆之灵_内法.品质.put("蓝器灵", (long)(d.元神器灵.琼浆之灵_内法.镶嵌 * rr[2]));
			d.元神器灵.琼浆之灵_内法.品质.put("紫器灵", (long)(d.元神器灵.琼浆之灵_内法.镶嵌 * rr[3]));
			d.元神器灵.琼浆之灵_内法.品质.put("橙器灵", (long)(d.元神器灵.琼浆之灵_内法.镶嵌 * rr[4]));
			
			d.元神器灵.琼浆之灵_内法.白器灵填充 = (float)randomRange(0,1) * d.元神器灵.琼浆之灵_内法.品质.get("白器灵");
			d.元神器灵.琼浆之灵_内法.绿器灵填充 = (float)randomRange(0,1) * d.元神器灵.琼浆之灵_内法.品质.get("绿器灵");
			d.元神器灵.琼浆之灵_内法.蓝器灵填充 = (float)randomRange(0,1) * d.元神器灵.琼浆之灵_内法.品质.get("蓝器灵");
			d.元神器灵.琼浆之灵_内法.紫器灵填充 = (float)randomRange(0,1) * d.元神器灵.琼浆之灵_内法.品质.get("紫器灵");
			d.元神器灵.琼浆之灵_内法.橙器灵填充 = (float)randomRange(0,1) * d.元神器灵.琼浆之灵_内法.品质.get("橙器灵");
			
			
			//
			d.元神器灵.金汤之灵_外防.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.元神器灵.金汤之灵_外防.镶嵌 = (long)(d.元神器灵.金汤之灵_外防.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.元神器灵.金汤之灵_外防.品质.put("白器灵", (long)(d.元神器灵.金汤之灵_外防.镶嵌 * rr[0]));
			d.元神器灵.金汤之灵_外防.品质.put("绿器灵", (long)(d.元神器灵.金汤之灵_外防.镶嵌 * rr[1]));
			d.元神器灵.金汤之灵_外防.品质.put("蓝器灵", (long)(d.元神器灵.金汤之灵_外防.镶嵌 * rr[2]));
			d.元神器灵.金汤之灵_外防.品质.put("紫器灵", (long)(d.元神器灵.金汤之灵_外防.镶嵌 * rr[3]));
			d.元神器灵.金汤之灵_外防.品质.put("橙器灵", (long)(d.元神器灵.金汤之灵_外防.镶嵌 * rr[4]));
			
			d.元神器灵.金汤之灵_外防.白器灵填充 = (float)randomRange(0,1) * d.元神器灵.金汤之灵_外防.品质.get("白器灵");
			d.元神器灵.金汤之灵_外防.绿器灵填充 = (float)randomRange(0,1) * d.元神器灵.金汤之灵_外防.品质.get("绿器灵");
			d.元神器灵.金汤之灵_外防.蓝器灵填充 = (float)randomRange(0,1) * d.元神器灵.金汤之灵_外防.品质.get("蓝器灵");
			d.元神器灵.金汤之灵_外防.紫器灵填充 = (float)randomRange(0,1) * d.元神器灵.金汤之灵_外防.品质.get("紫器灵");
			d.元神器灵.金汤之灵_外防.橙器灵填充 = (float)randomRange(0,1) * d.元神器灵.金汤之灵_外防.品质.get("橙器灵");
			
			
			//
			d.元神器灵.罡岚之灵_内防.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.元神器灵.罡岚之灵_内防.镶嵌 = (long)(d.元神器灵.罡岚之灵_内防.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.元神器灵.罡岚之灵_内防.品质.put("白器灵", (long)(d.元神器灵.罡岚之灵_内防.镶嵌 * rr[0]));
			d.元神器灵.罡岚之灵_内防.品质.put("绿器灵", (long)(d.元神器灵.罡岚之灵_内防.镶嵌 * rr[1]));
			d.元神器灵.罡岚之灵_内防.品质.put("蓝器灵", (long)(d.元神器灵.罡岚之灵_内防.镶嵌 * rr[2]));
			d.元神器灵.罡岚之灵_内防.品质.put("紫器灵", (long)(d.元神器灵.罡岚之灵_内防.镶嵌 * rr[3]));
			d.元神器灵.罡岚之灵_内防.品质.put("橙器灵", (long)(d.元神器灵.罡岚之灵_内防.镶嵌 * rr[4]));
			
			d.元神器灵.罡岚之灵_内防.白器灵填充 = (float)randomRange(0,1) * d.元神器灵.罡岚之灵_内防.品质.get("白器灵");
			d.元神器灵.罡岚之灵_内防.绿器灵填充 = (float)randomRange(0,1) * d.元神器灵.罡岚之灵_内防.品质.get("绿器灵");
			d.元神器灵.罡岚之灵_内防.蓝器灵填充 = (float)randomRange(0,1) * d.元神器灵.罡岚之灵_内防.品质.get("蓝器灵");
			d.元神器灵.罡岚之灵_内防.紫器灵填充 = (float)randomRange(0,1) * d.元神器灵.罡岚之灵_内防.品质.get("紫器灵");
			d.元神器灵.罡岚之灵_内防.橙器灵填充 = (float)randomRange(0,1) * d.元神器灵.罡岚之灵_内防.品质.get("橙器灵");
			
			
			//
			d.元神器灵.离火之灵_炎焚攻击.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.元神器灵.离火之灵_炎焚攻击.镶嵌 = (long)(d.元神器灵.离火之灵_炎焚攻击.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.元神器灵.离火之灵_炎焚攻击.品质.put("白器灵", (long)(d.元神器灵.离火之灵_炎焚攻击.镶嵌 * rr[0]));
			d.元神器灵.离火之灵_炎焚攻击.品质.put("绿器灵", (long)(d.元神器灵.离火之灵_炎焚攻击.镶嵌 * rr[1]));
			d.元神器灵.离火之灵_炎焚攻击.品质.put("蓝器灵", (long)(d.元神器灵.离火之灵_炎焚攻击.镶嵌 * rr[2]));
			d.元神器灵.离火之灵_炎焚攻击.品质.put("紫器灵", (long)(d.元神器灵.离火之灵_炎焚攻击.镶嵌 * rr[3]));
			d.元神器灵.离火之灵_炎焚攻击.品质.put("橙器灵", (long)(d.元神器灵.离火之灵_炎焚攻击.镶嵌 * rr[4]));
			
			d.元神器灵.离火之灵_炎焚攻击.白器灵填充 = (float)randomRange(0,1) * d.元神器灵.离火之灵_炎焚攻击.品质.get("白器灵");
			d.元神器灵.离火之灵_炎焚攻击.绿器灵填充 = (float)randomRange(0,1) * d.元神器灵.离火之灵_炎焚攻击.品质.get("绿器灵");
			d.元神器灵.离火之灵_炎焚攻击.蓝器灵填充 = (float)randomRange(0,1) * d.元神器灵.离火之灵_炎焚攻击.品质.get("蓝器灵");
			d.元神器灵.离火之灵_炎焚攻击.紫器灵填充 = (float)randomRange(0,1) * d.元神器灵.离火之灵_炎焚攻击.品质.get("紫器灵");
			d.元神器灵.离火之灵_炎焚攻击.橙器灵填充 = (float)randomRange(0,1) * d.元神器灵.离火之灵_炎焚攻击.品质.get("橙器灵");
			
			
			//
			d.元神器灵.玄冰之灵_玄冰攻击.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.元神器灵.玄冰之灵_玄冰攻击.镶嵌 = (long)(d.元神器灵.玄冰之灵_玄冰攻击.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.元神器灵.玄冰之灵_玄冰攻击.品质.put("白器灵", (long)(d.元神器灵.玄冰之灵_玄冰攻击.镶嵌 * rr[0]));
			d.元神器灵.玄冰之灵_玄冰攻击.品质.put("绿器灵", (long)(d.元神器灵.玄冰之灵_玄冰攻击.镶嵌 * rr[1]));
			d.元神器灵.玄冰之灵_玄冰攻击.品质.put("蓝器灵", (long)(d.元神器灵.玄冰之灵_玄冰攻击.镶嵌 * rr[2]));
			d.元神器灵.玄冰之灵_玄冰攻击.品质.put("紫器灵", (long)(d.元神器灵.玄冰之灵_玄冰攻击.镶嵌 * rr[3]));
			d.元神器灵.玄冰之灵_玄冰攻击.品质.put("橙器灵", (long)(d.元神器灵.玄冰之灵_玄冰攻击.镶嵌 * rr[4]));
			
			d.元神器灵.玄冰之灵_玄冰攻击.白器灵填充 = (float)randomRange(0,1) * d.元神器灵.玄冰之灵_玄冰攻击.品质.get("白器灵");
			d.元神器灵.玄冰之灵_玄冰攻击.绿器灵填充 = (float)randomRange(0,1) * d.元神器灵.玄冰之灵_玄冰攻击.品质.get("绿器灵");
			d.元神器灵.玄冰之灵_玄冰攻击.蓝器灵填充 = (float)randomRange(0,1) * d.元神器灵.玄冰之灵_玄冰攻击.品质.get("蓝器灵");
			d.元神器灵.玄冰之灵_玄冰攻击.紫器灵填充 = (float)randomRange(0,1) * d.元神器灵.玄冰之灵_玄冰攻击.品质.get("紫器灵");
			d.元神器灵.玄冰之灵_玄冰攻击.橙器灵填充 = (float)randomRange(0,1) * d.元神器灵.玄冰之灵_玄冰攻击.品质.get("橙器灵");
			
			
			//
			d.元神器灵.飓风之灵_疾风攻击.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.元神器灵.飓风之灵_疾风攻击.镶嵌 = (long)(d.元神器灵.飓风之灵_疾风攻击.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.元神器灵.飓风之灵_疾风攻击.品质.put("白器灵", (long)(d.元神器灵.飓风之灵_疾风攻击.镶嵌 * rr[0]));
			d.元神器灵.飓风之灵_疾风攻击.品质.put("绿器灵", (long)(d.元神器灵.飓风之灵_疾风攻击.镶嵌 * rr[1]));
			d.元神器灵.飓风之灵_疾风攻击.品质.put("蓝器灵", (long)(d.元神器灵.飓风之灵_疾风攻击.镶嵌 * rr[2]));
			d.元神器灵.飓风之灵_疾风攻击.品质.put("紫器灵", (long)(d.元神器灵.飓风之灵_疾风攻击.镶嵌 * rr[3]));
			d.元神器灵.飓风之灵_疾风攻击.品质.put("橙器灵", (long)(d.元神器灵.飓风之灵_疾风攻击.镶嵌 * rr[4]));
			
			d.元神器灵.飓风之灵_疾风攻击.白器灵填充 = (float)randomRange(0,1) * d.元神器灵.飓风之灵_疾风攻击.品质.get("白器灵");
			d.元神器灵.飓风之灵_疾风攻击.绿器灵填充 = (float)randomRange(0,1) * d.元神器灵.飓风之灵_疾风攻击.品质.get("绿器灵");
			d.元神器灵.飓风之灵_疾风攻击.蓝器灵填充 = (float)randomRange(0,1) * d.元神器灵.飓风之灵_疾风攻击.品质.get("蓝器灵");
			d.元神器灵.飓风之灵_疾风攻击.紫器灵填充 = (float)randomRange(0,1) * d.元神器灵.飓风之灵_疾风攻击.品质.get("紫器灵");
			d.元神器灵.飓风之灵_疾风攻击.橙器灵填充 = (float)randomRange(0,1) * d.元神器灵.飓风之灵_疾风攻击.品质.get("橙器灵");
			
			
			//
			d.元神器灵.惊雷之灵_狂雷攻击.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.元神器灵.惊雷之灵_狂雷攻击.镶嵌 = (long)(d.元神器灵.惊雷之灵_狂雷攻击.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.元神器灵.惊雷之灵_狂雷攻击.品质.put("白器灵", (long)(d.元神器灵.惊雷之灵_狂雷攻击.镶嵌 * rr[0]));
			d.元神器灵.惊雷之灵_狂雷攻击.品质.put("绿器灵", (long)(d.元神器灵.惊雷之灵_狂雷攻击.镶嵌 * rr[1]));
			d.元神器灵.惊雷之灵_狂雷攻击.品质.put("蓝器灵", (long)(d.元神器灵.惊雷之灵_狂雷攻击.镶嵌 * rr[2]));
			d.元神器灵.惊雷之灵_狂雷攻击.品质.put("紫器灵", (long)(d.元神器灵.惊雷之灵_狂雷攻击.镶嵌 * rr[3]));
			d.元神器灵.惊雷之灵_狂雷攻击.品质.put("橙器灵", (long)(d.元神器灵.惊雷之灵_狂雷攻击.镶嵌 * rr[4]));
			
			d.元神器灵.惊雷之灵_狂雷攻击.白器灵填充 = (float)randomRange(0,1) * d.元神器灵.惊雷之灵_狂雷攻击.品质.get("白器灵");
			d.元神器灵.惊雷之灵_狂雷攻击.绿器灵填充 = (float)randomRange(0,1) * d.元神器灵.惊雷之灵_狂雷攻击.品质.get("绿器灵");
			d.元神器灵.惊雷之灵_狂雷攻击.蓝器灵填充 = (float)randomRange(0,1) * d.元神器灵.惊雷之灵_狂雷攻击.品质.get("蓝器灵");
			d.元神器灵.惊雷之灵_狂雷攻击.紫器灵填充 = (float)randomRange(0,1) * d.元神器灵.惊雷之灵_狂雷攻击.品质.get("紫器灵");
			d.元神器灵.惊雷之灵_狂雷攻击.橙器灵填充 = (float)randomRange(0,1) * d.元神器灵.惊雷之灵_狂雷攻击.品质.get("橙器灵");
			
			
			//
			d.元神器灵.御火之灵_炎焚防御.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.元神器灵.御火之灵_炎焚防御.镶嵌 = (long)(d.元神器灵.御火之灵_炎焚防御.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.元神器灵.御火之灵_炎焚防御.品质.put("白器灵", (long)(d.元神器灵.御火之灵_炎焚防御.镶嵌 * rr[0]));
			d.元神器灵.御火之灵_炎焚防御.品质.put("绿器灵", (long)(d.元神器灵.御火之灵_炎焚防御.镶嵌 * rr[1]));
			d.元神器灵.御火之灵_炎焚防御.品质.put("蓝器灵", (long)(d.元神器灵.御火之灵_炎焚防御.镶嵌 * rr[2]));
			d.元神器灵.御火之灵_炎焚防御.品质.put("紫器灵", (long)(d.元神器灵.御火之灵_炎焚防御.镶嵌 * rr[3]));
			d.元神器灵.御火之灵_炎焚防御.品质.put("橙器灵", (long)(d.元神器灵.御火之灵_炎焚防御.镶嵌 * rr[4]));
			
			d.元神器灵.御火之灵_炎焚防御.白器灵填充 = (float)randomRange(0,1) * d.元神器灵.御火之灵_炎焚防御.品质.get("白器灵");
			d.元神器灵.御火之灵_炎焚防御.绿器灵填充 = (float)randomRange(0,1) * d.元神器灵.御火之灵_炎焚防御.品质.get("绿器灵");
			d.元神器灵.御火之灵_炎焚防御.蓝器灵填充 = (float)randomRange(0,1) * d.元神器灵.御火之灵_炎焚防御.品质.get("蓝器灵");
			d.元神器灵.御火之灵_炎焚防御.紫器灵填充 = (float)randomRange(0,1) * d.元神器灵.御火之灵_炎焚防御.品质.get("紫器灵");
			d.元神器灵.御火之灵_炎焚防御.橙器灵填充 = (float)randomRange(0,1) * d.元神器灵.御火之灵_炎焚防御.品质.get("橙器灵");
			
			
			//
			d.元神器灵.御冰之灵_玄冰防御.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.元神器灵.御冰之灵_玄冰防御.镶嵌 = (long)(d.元神器灵.御冰之灵_玄冰防御.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.元神器灵.御冰之灵_玄冰防御.品质.put("白器灵", (long)(d.元神器灵.御冰之灵_玄冰防御.镶嵌 * rr[0]));
			d.元神器灵.御冰之灵_玄冰防御.品质.put("绿器灵", (long)(d.元神器灵.御冰之灵_玄冰防御.镶嵌 * rr[1]));
			d.元神器灵.御冰之灵_玄冰防御.品质.put("蓝器灵", (long)(d.元神器灵.御冰之灵_玄冰防御.镶嵌 * rr[2]));
			d.元神器灵.御冰之灵_玄冰防御.品质.put("紫器灵", (long)(d.元神器灵.御冰之灵_玄冰防御.镶嵌 * rr[3]));
			d.元神器灵.御冰之灵_玄冰防御.品质.put("橙器灵", (long)(d.元神器灵.御冰之灵_玄冰防御.镶嵌 * rr[4]));
			
			d.元神器灵.御冰之灵_玄冰防御.白器灵填充 = (float)randomRange(0,1) * d.元神器灵.御冰之灵_玄冰防御.品质.get("白器灵");
			d.元神器灵.御冰之灵_玄冰防御.绿器灵填充 = (float)randomRange(0,1) * d.元神器灵.御冰之灵_玄冰防御.品质.get("绿器灵");
			d.元神器灵.御冰之灵_玄冰防御.蓝器灵填充 = (float)randomRange(0,1) * d.元神器灵.御冰之灵_玄冰防御.品质.get("蓝器灵");
			d.元神器灵.御冰之灵_玄冰防御.紫器灵填充 = (float)randomRange(0,1) * d.元神器灵.御冰之灵_玄冰防御.品质.get("紫器灵");
			d.元神器灵.御冰之灵_玄冰防御.橙器灵填充 = (float)randomRange(0,1) * d.元神器灵.御冰之灵_玄冰防御.品质.get("橙器灵");
			
			
			//
			d.元神器灵.御风之灵_疾风防御.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.元神器灵.御风之灵_疾风防御.镶嵌 = (long)(d.元神器灵.御风之灵_疾风防御.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.元神器灵.御风之灵_疾风防御.品质.put("白器灵", (long)(d.元神器灵.御风之灵_疾风防御.镶嵌 * rr[0]));
			d.元神器灵.御风之灵_疾风防御.品质.put("绿器灵", (long)(d.元神器灵.御风之灵_疾风防御.镶嵌 * rr[1]));
			d.元神器灵.御风之灵_疾风防御.品质.put("蓝器灵", (long)(d.元神器灵.御风之灵_疾风防御.镶嵌 * rr[2]));
			d.元神器灵.御风之灵_疾风防御.品质.put("紫器灵", (long)(d.元神器灵.御风之灵_疾风防御.镶嵌 * rr[3]));
			d.元神器灵.御风之灵_疾风防御.品质.put("橙器灵", (long)(d.元神器灵.御风之灵_疾风防御.镶嵌 * rr[4]));
			
			d.元神器灵.御风之灵_疾风防御.白器灵填充 = (float)randomRange(0,1) * d.元神器灵.御风之灵_疾风防御.品质.get("白器灵");
			d.元神器灵.御风之灵_疾风防御.绿器灵填充 = (float)randomRange(0,1) * d.元神器灵.御风之灵_疾风防御.品质.get("绿器灵");
			d.元神器灵.御风之灵_疾风防御.蓝器灵填充 = (float)randomRange(0,1) * d.元神器灵.御风之灵_疾风防御.品质.get("蓝器灵");
			d.元神器灵.御风之灵_疾风防御.紫器灵填充 = (float)randomRange(0,1) * d.元神器灵.御风之灵_疾风防御.品质.get("紫器灵");
			d.元神器灵.御风之灵_疾风防御.橙器灵填充 = (float)randomRange(0,1) * d.元神器灵.御风之灵_疾风防御.品质.get("橙器灵");
			
			
			//
			d.元神器灵.御雷之灵_狂雷防御.槽数 = (long)(d.人数 * randomRange(0.6,1));
			d.元神器灵.御雷之灵_狂雷防御.镶嵌 = (long)(d.元神器灵.御雷之灵_狂雷防御.槽数 * randomRange(0.6,1));
			
			rr = randomDistribute(5);
			d.元神器灵.御雷之灵_狂雷防御.品质.put("白器灵", (long)(d.元神器灵.御雷之灵_狂雷防御.镶嵌 * rr[0]));
			d.元神器灵.御雷之灵_狂雷防御.品质.put("绿器灵", (long)(d.元神器灵.御雷之灵_狂雷防御.镶嵌 * rr[1]));
			d.元神器灵.御雷之灵_狂雷防御.品质.put("蓝器灵", (long)(d.元神器灵.御雷之灵_狂雷防御.镶嵌 * rr[2]));
			d.元神器灵.御雷之灵_狂雷防御.品质.put("紫器灵", (long)(d.元神器灵.御雷之灵_狂雷防御.镶嵌 * rr[3]));
			d.元神器灵.御雷之灵_狂雷防御.品质.put("橙器灵", (long)(d.元神器灵.御雷之灵_狂雷防御.镶嵌 * rr[4]));
			
			d.元神器灵.御雷之灵_狂雷防御.白器灵填充 = (float)randomRange(0,1) * d.元神器灵.御雷之灵_狂雷防御.品质.get("白器灵");
			d.元神器灵.御雷之灵_狂雷防御.绿器灵填充 = (float)randomRange(0,1) * d.元神器灵.御雷之灵_狂雷防御.品质.get("绿器灵");
			d.元神器灵.御雷之灵_狂雷防御.蓝器灵填充 = (float)randomRange(0,1) * d.元神器灵.御雷之灵_狂雷防御.品质.get("蓝器灵");
			d.元神器灵.御雷之灵_狂雷防御.紫器灵填充 = (float)randomRange(0,1) * d.元神器灵.御雷之灵_狂雷防御.品质.get("紫器灵");
			d.元神器灵.御雷之灵_狂雷防御.橙器灵填充 = (float)randomRange(0,1) * d.元神器灵.御雷之灵_狂雷防御.品质.get("橙器灵");
			
			
			/////
			
			d.元神坐骑.坐骑数量 = (long)(d.人数 * randomRange(0.6,1));
			
			//
			d.元神坐骑.面甲.数量 = (long)(d.元神坐骑.坐骑数量 * randomRange(0.6,1));
			d.元神坐骑.面甲.强化 = (long)(d.元神坐骑.面甲.数量 * 20 * randomRange(0.6,1));
			
			rr = randomDistribute(7);
			d.元神坐骑.面甲.颜色.put("白", (long)(rr[0] * d.元神坐骑.面甲.数量));
			d.元神坐骑.面甲.颜色.put("绿", (long)(rr[1] * d.元神坐骑.面甲.数量));
			d.元神坐骑.面甲.颜色.put("蓝", (long)(rr[2] * d.元神坐骑.面甲.数量));
			d.元神坐骑.面甲.颜色.put("紫", (long)(rr[3] * d.元神坐骑.面甲.数量));
			d.元神坐骑.面甲.颜色.put("完美紫", (long)(rr[4] * d.元神坐骑.面甲.数量));
			d.元神坐骑.面甲.颜色.put("橙", (long)(rr[5] * d.元神坐骑.面甲.数量));
			d.元神坐骑.面甲.颜色.put("完美橙", (long)(rr[6] * d.元神坐骑.面甲.数量));
			
			//
			d.元神坐骑.颈甲.数量 = (long)(d.元神坐骑.坐骑数量 * randomRange(0.6,1));
			d.元神坐骑.颈甲.强化 = (long)(d.元神坐骑.颈甲.数量 * 20 * randomRange(0.6,1));
			
			rr = randomDistribute(7);
			d.元神坐骑.颈甲.颜色.put("白", (long)(rr[0] * d.元神坐骑.颈甲.数量));
			d.元神坐骑.颈甲.颜色.put("绿", (long)(rr[1] * d.元神坐骑.颈甲.数量));
			d.元神坐骑.颈甲.颜色.put("蓝", (long)(rr[2] * d.元神坐骑.颈甲.数量));
			d.元神坐骑.颈甲.颜色.put("紫", (long)(rr[3] * d.元神坐骑.颈甲.数量));
			d.元神坐骑.颈甲.颜色.put("完美紫", (long)(rr[4] * d.元神坐骑.颈甲.数量));
			d.元神坐骑.颈甲.颜色.put("橙", (long)(rr[5] * d.元神坐骑.颈甲.数量));
			d.元神坐骑.颈甲.颜色.put("完美橙", (long)(rr[6] * d.元神坐骑.颈甲.数量));
			
			//
			d.元神坐骑.体铠.数量 = (long)(d.元神坐骑.坐骑数量 * randomRange(0.6,1));
			d.元神坐骑.体铠.强化 = (long)(d.元神坐骑.体铠.数量 * 20 * randomRange(0.6,1));
			
			rr = randomDistribute(7);
			d.元神坐骑.体铠.颜色.put("白", (long)(rr[0] * d.元神坐骑.体铠.数量));
			d.元神坐骑.体铠.颜色.put("绿", (long)(rr[1] * d.元神坐骑.体铠.数量));
			d.元神坐骑.体铠.颜色.put("蓝", (long)(rr[2] * d.元神坐骑.体铠.数量));
			d.元神坐骑.体铠.颜色.put("紫", (long)(rr[3] * d.元神坐骑.体铠.数量));
			d.元神坐骑.体铠.颜色.put("完美紫", (long)(rr[4] * d.元神坐骑.体铠.数量));
			d.元神坐骑.体铠.颜色.put("橙", (long)(rr[5] * d.元神坐骑.体铠.数量));
			d.元神坐骑.体铠.颜色.put("完美橙", (long)(rr[6] * d.元神坐骑.体铠.数量));
			
			//
			d.元神坐骑.鞍铠.数量 = (long)(d.元神坐骑.坐骑数量 * randomRange(0.6,1));
			d.元神坐骑.鞍铠.强化 = (long)(d.元神坐骑.鞍铠.数量 * 20 * randomRange(0.6,1));
			
			rr = randomDistribute(7);
			d.元神坐骑.鞍铠.颜色.put("白", (long)(rr[0] * d.元神坐骑.鞍铠.数量));
			d.元神坐骑.鞍铠.颜色.put("绿", (long)(rr[1] * d.元神坐骑.鞍铠.数量));
			d.元神坐骑.鞍铠.颜色.put("蓝", (long)(rr[2] * d.元神坐骑.鞍铠.数量));
			d.元神坐骑.鞍铠.颜色.put("紫", (long)(rr[3] * d.元神坐骑.鞍铠.数量));
			d.元神坐骑.鞍铠.颜色.put("完美紫", (long)(rr[4] * d.元神坐骑.鞍铠.数量));
			d.元神坐骑.鞍铠.颜色.put("橙", (long)(rr[5] * d.元神坐骑.鞍铠.数量));
			d.元神坐骑.鞍铠.颜色.put("完美橙", (long)(rr[6] * d.元神坐骑.鞍铠.数量));
			
			//
			d.元神坐骑.蹄甲.数量 = (long)(d.元神坐骑.坐骑数量 * randomRange(0.6,1));
			d.元神坐骑.蹄甲.强化 = (long)(d.元神坐骑.蹄甲.数量 * 20 * randomRange(0.6,1));
			
			rr = randomDistribute(7);
			d.元神坐骑.蹄甲.颜色.put("白", (long)(rr[0] * d.元神坐骑.蹄甲.数量));
			d.元神坐骑.蹄甲.颜色.put("绿", (long)(rr[1] * d.元神坐骑.蹄甲.数量));
			d.元神坐骑.蹄甲.颜色.put("蓝", (long)(rr[2] * d.元神坐骑.蹄甲.数量));
			d.元神坐骑.蹄甲.颜色.put("紫", (long)(rr[3] * d.元神坐骑.蹄甲.数量));
			d.元神坐骑.蹄甲.颜色.put("完美紫", (long)(rr[4] * d.元神坐骑.蹄甲.数量));
			d.元神坐骑.蹄甲.颜色.put("橙", (long)(rr[5] * d.元神坐骑.蹄甲.数量));
			d.元神坐骑.蹄甲.颜色.put("完美橙", (long)(rr[6] * d.元神坐骑.蹄甲.数量));
			
		//////
			d.元神技能._41级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.元神技能._56级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.元神技能._71级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.元神技能._86级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.元神技能._101级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.元神技能._116级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.元神技能._131级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.元神技能._146级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.元神技能._161级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.元神技能._176级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.元神技能._191级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
			d.元神技能._206级等级 = (long)(d.人数 * 15 * randomRange(0.6,1));
		}
	}
	
	public static double[] randomDistribute(int n){
		if(n == 0) return new double[0];
		double d[] = new double[n];
		for(int i = 0 ; i < n ; i ++){
			d[i] = Math.random(); 
		}
		float t = 0;
		for(int i = 0 ; i < n ; i ++){
			t+= d[i];
		}
		for(int i = 0 ; i < n ; i ++){
			d[i] = d[i]/t;
		}
		return d;
			
		
	} 
	
	public static double randomRange(double a,double b){
		return a + (b - a) * Math.random();	
	} 
}
